zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/*****************  Bit definition for DCMIPP_IPGR2 register  *****************/
#define DCMIPP_IPGR2_PSTART_Pos           (0U)
#define DCMIPP_IPGR2_PSTART_Msk           (0x1UL << DCMIPP_IPGR2_PSTART_Pos)             /*!< 0x00000001 */
#define DCMIPP_IPGR2_PSTART               DCMIPP_IPGR2_PSTART_Msk                       /*!< request to lock the IP-Plug, to allow reconfiguration. */

/*****************  Bit definition for DCMIPP_IPGR3 register  *****************/
#define DCMIPP_IPGR3_IDLE_Pos             (0U)
#define DCMIPP_IPGR3_IDLE_Msk             (0x1UL << DCMIPP_IPGR3_IDLE_Pos)               /*!< 0x00000001 */
#define DCMIPP_IPGR3_IDLE                 DCMIPP_IPGR3_IDLE_Msk                         /*!< status of IP-Plug. */

/*****************  Bit definition for DCMIPP_IPGR8 register  *****************/
#define DCMIPP_IPGR8_DID_Pos              (0U)
#define DCMIPP_IPGR8_DID_Msk              (0x3FUL << DCMIPP_IPGR8_DID_Pos)               /*!< 0x0000003F */
#define DCMIPP_IPGR8_DID                  DCMIPP_IPGR8_DID_Msk                          /*!< division identifier (0x14) */
#define DCMIPP_IPGR8_DID_0                (0x1UL << DCMIPP_IPGR8_DID_Pos)                /*!< 0x00000001 */
#define DCMIPP_IPGR8_DID_1                (0x2UL << DCMIPP_IPGR8_DID_Pos)                /*!< 0x00000002 */
#define DCMIPP_IPGR8_DID_2                (0x4UL << DCMIPP_IPGR8_DID_Pos)                /*!< 0x00000004 */
#define DCMIPP_IPGR8_DID_3                (0x8UL << DCMIPP_IPGR8_DID_Pos)                /*!< 0x00000008 */
#define DCMIPP_IPGR8_DID_4                (0x10UL << DCMIPP_IPGR8_DID_Pos)               /*!< 0x00000010 */
#define DCMIPP_IPGR8_DID_5                (0x20UL << DCMIPP_IPGR8_DID_Pos)               /*!< 0x00000020 */
#define DCMIPP_IPGR8_REVID_Pos            (8U)
#define DCMIPP_IPGR8_REVID_Msk            (0x1FUL << DCMIPP_IPGR8_REVID_Pos)             /*!< 0x00001F00 */
#define DCMIPP_IPGR8_REVID                DCMIPP_IPGR8_REVID_Msk                        /*!< revision identifier (0x03) */
#define DCMIPP_IPGR8_REVID_0              (0x1UL << DCMIPP_IPGR8_REVID_Pos)            /*!< 0x00000100 */
#define DCMIPP_IPGR8_REVID_1              (0x2UL << DCMIPP_IPGR8_REVID_Pos)            /*!< 0x00000200 */
#define DCMIPP_IPGR8_REVID_2              (0x4UL << DCMIPP_IPGR8_REVID_Pos)            /*!< 0x00000400 */
#define DCMIPP_IPGR8_REVID_3              (0x8UL << DCMIPP_IPGR8_REVID_Pos)            /*!< 0x00000800 */
#define DCMIPP_IPGR8_REVID_4              (0x10UL << DCMIPP_IPGR8_REVID_Pos)           /*!< 0x00001000 */
#define DCMIPP_IPGR8_ARCHIID_Pos          (16U)
#define DCMIPP_IPGR8_ARCHIID_Msk          (0x1FUL << DCMIPP_IPGR8_ARCHIID_Pos)           /*!< 0x001F0000 */
#define DCMIPP_IPGR8_ARCHIID              DCMIPP_IPGR8_ARCHIID_Msk                      /*!< architecture identifier (0x04) */
#define DCMIPP_IPGR8_ARCHIID_0            (0x1UL << DCMIPP_IPGR8_ARCHIID_Pos)        /*!< 0x00010000 */
#define DCMIPP_IPGR8_ARCHIID_1            (0x2UL << DCMIPP_IPGR8_ARCHIID_Pos)        /*!< 0x00020000 */
#define DCMIPP_IPGR8_ARCHIID_2            (0x4UL << DCMIPP_IPGR8_ARCHIID_Pos)        /*!< 0x00040000 */
#define DCMIPP_IPGR8_ARCHIID_3            (0x8UL << DCMIPP_IPGR8_ARCHIID_Pos)        /*!< 0x00080000 */
#define DCMIPP_IPGR8_ARCHIID_4            (0x10UL << DCMIPP_IPGR8_ARCHIID_Pos)       /*!< 0x00100000 */
#define DCMIPP_IPGR8_IPPID_Pos            (24U)
#define DCMIPP_IPGR8_IPPID_Msk            (0xFFUL << DCMIPP_IPGR8_IPPID_Pos)             /*!< 0xFF000000 */
#define DCMIPP_IPGR8_IPPID                DCMIPP_IPGR8_IPPID_Msk                        /*!< IP identifier (0xAA) */
#define DCMIPP_IPGR8_IPPID_0              (0x1UL << DCMIPP_IPGR8_IPPID_Pos)        /*!< 0x01000000 */
#define DCMIPP_IPGR8_IPPID_1              (0x2UL << DCMIPP_IPGR8_IPPID_Pos)        /*!< 0x02000000 */
#define DCMIPP_IPGR8_IPPID_2              (0x4UL << DCMIPP_IPGR8_IPPID_Pos)        /*!< 0x04000000 */
#define DCMIPP_IPGR8_IPPID_3              (0x8UL << DCMIPP_IPGR8_IPPID_Pos)        /*!< 0x08000000 */
#define DCMIPP_IPGR8_IPPID_4              (0x10UL << DCMIPP_IPGR8_IPPID_Pos)       /*!< 0x10000000 */
#define DCMIPP_IPGR8_IPPID_5              (0x20UL << DCMIPP_IPGR8_IPPID_Pos)       /*!< 0x20000000 */
#define DCMIPP_IPGR8_IPPID_6              (0x40UL << DCMIPP_IPGR8_IPPID_Pos)       /*!< 0x40000000 */
#define DCMIPP_IPGR8_IPPID_7              (0x80UL << DCMIPP_IPGR8_IPPID_Pos)       /*!< 0x80000000 */

/****************  Bit definition for DCMIPP_IPC1R1 register  *****************/
#define DCMIPP_IPC1R1_TRAFFIC_Pos         (0U)
#define DCMIPP_IPC1R1_TRAFFIC_Msk         (0x7UL << DCMIPP_IPC1R1_TRAFFIC_Pos)           /*!< 0x00000007 */
#define DCMIPP_IPC1R1_TRAFFIC             DCMIPP_IPC1R1_TRAFFIC_Msk                     /*!< burst size as power2 of 8Bytes units */
#define DCMIPP_IPC1R1_TRAFFIC_0           (0x1UL << DCMIPP_IPC1R1_TRAFFIC_Pos)           /*!< 0x00000001 */
#define DCMIPP_IPC1R1_TRAFFIC_1           (0x2UL << DCMIPP_IPC1R1_TRAFFIC_Pos)           /*!< 0x00000002 */
#define DCMIPP_IPC1R1_TRAFFIC_2           (0x4UL << DCMIPP_IPC1R1_TRAFFIC_Pos)           /*!< 0x00000004 */
#define DCMIPP_IPC1R1_OTR_Pos             (8U)
#define DCMIPP_IPC1R1_OTR_Msk             (0xFUL << DCMIPP_IPC1R1_OTR_Pos)               /*!< 0x00000F00 */
#define DCMIPP_IPC1R1_OTR                 DCMIPP_IPC1R1_OTR_Msk                         /*!< max outstanding transactions: */
#define DCMIPP_IPC1R1_OTR_0               (0x1UL << DCMIPP_IPC1R1_OTR_Pos)             /*!< 0x00000100 */
#define DCMIPP_IPC1R1_OTR_1               (0x2UL << DCMIPP_IPC1R1_OTR_Pos)             /*!< 0x00000200 */
#define DCMIPP_IPC1R1_OTR_2               (0x4UL << DCMIPP_IPC1R1_OTR_Pos)             /*!< 0x00000400 */
#define DCMIPP_IPC1R1_OTR_3               (0x8UL << DCMIPP_IPC1R1_OTR_Pos)             /*!< 0x00000800 */

/****************  Bit definition for DCMIPP_IPC1R2 register  *****************/
#define DCMIPP_IPC1R2_SVCMAPPING_Pos      (8U)
#define DCMIPP_IPC1R2_SVCMAPPING_Msk      (0xFUL << DCMIPP_IPC1R2_SVCMAPPING_Pos)        /*!< 0x00000F00 */
#define DCMIPP_IPC1R2_SVCMAPPING          DCMIPP_IPC1R2_SVCMAPPING_Msk                  /*!< Non-User, must be kept at reset value. */
#define DCMIPP_IPC1R2_SVCMAPPING_0        (0x1UL << DCMIPP_IPC1R2_SVCMAPPING_Pos)      /*!< 0x00000100 */
#define DCMIPP_IPC1R2_SVCMAPPING_1        (0x2UL << DCMIPP_IPC1R2_SVCMAPPING_Pos)      /*!< 0x00000200 */
#define DCMIPP_IPC1R2_SVCMAPPING_2        (0x4UL << DCMIPP_IPC1R2_SVCMAPPING_Pos)      /*!< 0x00000400 */
#define DCMIPP_IPC1R2_SVCMAPPING_3        (0x8UL << DCMIPP_IPC1R2_SVCMAPPING_Pos)      /*!< 0x00000800 */
#define DCMIPP_IPC1R2_WLRU_Pos            (16U)
#define DCMIPP_IPC1R2_WLRU_Msk            (0xFUL << DCMIPP_IPC1R2_WLRU_Pos)              /*!< 0x000F0000 */
#define DCMIPP_IPC1R2_WLRU                DCMIPP_IPC1R2_WLRU_Msk                        /*!< ratio for WLRU[3:0] arbitration: */
#define DCMIPP_IPC1R2_WLRU_0              (0x1UL << DCMIPP_IPC1R2_WLRU_Pos)          /*!< 0x00010000 */
#define DCMIPP_IPC1R2_WLRU_1              (0x2UL << DCMIPP_IPC1R2_WLRU_Pos)          /*!< 0x00020000 */
#define DCMIPP_IPC1R2_WLRU_2              (0x4UL << DCMIPP_IPC1R2_WLRU_Pos)          /*!< 0x00040000 */
#define DCMIPP_IPC1R2_WLRU_3              (0x8UL << DCMIPP_IPC1R2_WLRU_Pos)          /*!< 0x00080000 */

/****************  Bit definition for DCMIPP_IPC1R3 register  *****************/
#define DCMIPP_IPC1R3_DPREGSTART_Pos      (0U)
#define DCMIPP_IPC1R3_DPREGSTART_Msk      (0x3FUL << DCMIPP_IPC1R3_DPREGSTART_Pos)       /*!< 0x0000003F */
#define DCMIPP_IPC1R3_DPREGSTART          DCMIPP_IPC1R3_DPREGSTART_Msk                  /*!< start word (AXI width, =64bit) of the fifo of this client. */
#define DCMIPP_IPC1R3_DPREGSTART_0        (0x1UL << DCMIPP_IPC1R3_DPREGSTART_Pos)        /*!< 0x00000001 */
#define DCMIPP_IPC1R3_DPREGSTART_1        (0x2UL << DCMIPP_IPC1R3_DPREGSTART_Pos)        /*!< 0x00000002 */
#define DCMIPP_IPC1R3_DPREGSTART_2        (0x4UL << DCMIPP_IPC1R3_DPREGSTART_Pos)        /*!< 0x00000004 */
#define DCMIPP_IPC1R3_DPREGSTART_3        (0x8UL << DCMIPP_IPC1R3_DPREGSTART_Pos)        /*!< 0x00000008 */
#define DCMIPP_IPC1R3_DPREGSTART_4        (0x10UL << DCMIPP_IPC1R3_DPREGSTART_Pos)       /*!< 0x00000010 */
#define DCMIPP_IPC1R3_DPREGSTART_5        (0x20UL << DCMIPP_IPC1R3_DPREGSTART_Pos)       /*!< 0x00000020 */
#define DCMIPP_IPC1R3_DPREGEND_Pos        (16U)
#define DCMIPP_IPC1R3_DPREGEND_Msk        (0x3FUL << DCMIPP_IPC1R3_DPREGEND_Pos)         /*!< 0x003F0000 */
#define DCMIPP_IPC1R3_DPREGEND            DCMIPP_IPC1R3_DPREGEND_Msk                    /*!< end word (AXI width, =64bit) of the fifo of this client. */
#define DCMIPP_IPC1R3_DPREGEND_0          (0x1UL << DCMIPP_IPC1R3_DPREGEND_Pos)      /*!< 0x00010000 */
#define DCMIPP_IPC1R3_DPREGEND_1          (0x2UL << DCMIPP_IPC1R3_DPREGEND_Pos)      /*!< 0x00020000 */
#define DCMIPP_IPC1R3_DPREGEND_2          (0x4UL << DCMIPP_IPC1R3_DPREGEND_Pos)      /*!< 0x00040000 */
#define DCMIPP_IPC1R3_DPREGEND_3          (0x8UL << DCMIPP_IPC1R3_DPREGEND_Pos)      /*!< 0x00080000 */
#define DCMIPP_IPC1R3_DPREGEND_4          (0x10UL << DCMIPP_IPC1R3_DPREGEND_Pos)     /*!< 0x00100000 */
#define DCMIPP_IPC1R3_DPREGEND_5          (0x20UL << DCMIPP_IPC1R3_DPREGEND_Pos)     /*!< 0x00200000 */

/***************  Bit definition for DCMIPP_PRHWCFGR register  ****************/

/*****************  Bit definition for DCMIPP_PRCR register  ******************/
#define DCMIPP_PRCR_ESS_Pos               (4U)
#define DCMIPP_PRCR_ESS_Msk               (0x1UL << DCMIPP_PRCR_ESS_Pos)                 /*!< 0x00000010 */
#define DCMIPP_PRCR_ESS                   DCMIPP_PRCR_ESS_Msk                           /*!< Embedded synchronization select */
#define DCMIPP_PRCR_PCKPOL_Pos            (5U)
#define DCMIPP_PRCR_PCKPOL_Msk            (0x1UL << DCMIPP_PRCR_PCKPOL_Pos)              /*!< 0x00000020 */
#define DCMIPP_PRCR_PCKPOL                DCMIPP_PRCR_PCKPOL_Msk                        /*!< Pixel clock polarity */
#define DCMIPP_PRCR_HSPOL_Pos             (6U)
#define DCMIPP_PRCR_HSPOL_Msk             (0x1UL << DCMIPP_PRCR_HSPOL_Pos)               /*!< 0x00000040 */
#define DCMIPP_PRCR_HSPOL                 DCMIPP_PRCR_HSPOL_Msk                         /*!< Horizontal synchronization polarity */
#define DCMIPP_PRCR_VSPOL_Pos             (7U)
#define DCMIPP_PRCR_VSPOL_Msk             (0x1UL << DCMIPP_PRCR_VSPOL_Pos)               /*!< 0x00000080 */
#define DCMIPP_PRCR_VSPOL                 DCMIPP_PRCR_VSPOL_Msk                         /*!< Vertical synchronization polarity */
#define DCMIPP_PRCR_EDM_Pos               (10U)
#define DCMIPP_PRCR_EDM_Msk               (0x7UL << DCMIPP_PRCR_EDM_Pos)                 /*!< 0x00001C00 */
#define DCMIPP_PRCR_EDM                   DCMIPP_PRCR_EDM_Msk                           /*!< Extended data mode */
#define DCMIPP_PRCR_EDM_0                 (0x1UL << DCMIPP_PRCR_EDM_Pos)               /*!< 0x00000400 */
#define DCMIPP_PRCR_EDM_1                 (0x2UL << DCMIPP_PRCR_EDM_Pos)               /*!< 0x00000800 */
#define DCMIPP_PRCR_EDM_2                 (0x4UL << DCMIPP_PRCR_EDM_Pos)              /*!< 0x00001000 */
#define DCMIPP_PRCR_ENABLE_Pos            (14U)
#define DCMIPP_PRCR_ENABLE_Msk            (0x1UL << DCMIPP_PRCR_ENABLE_Pos)              /*!< 0x00004000 */
#define DCMIPP_PRCR_ENABLE                DCMIPP_PRCR_ENABLE_Msk                        /*!< Parallel Interface enable */
#define DCMIPP_PRCR_FORMAT_Pos            (16U)
#define DCMIPP_PRCR_FORMAT_Msk            (0xFFUL << DCMIPP_PRCR_FORMAT_Pos)             /*!< 0x00FF0000 */
#define DCMIPP_PRCR_FORMAT                DCMIPP_PRCR_FORMAT_Msk                        /*!< Others: Data is captured and output as-is through the data/dump pipeline only(for Instance the JPEG or the Byte input format. */
#define DCMIPP_PRCR_FORMAT_0              (0x1UL << DCMIPP_PRCR_FORMAT_Pos)          /*!< 0x00010000 */
#define DCMIPP_PRCR_FORMAT_1              (0x2UL << DCMIPP_PRCR_FORMAT_Pos)          /*!< 0x00020000 */
#define DCMIPP_PRCR_FORMAT_2              (0x4UL << DCMIPP_PRCR_FORMAT_Pos)          /*!< 0x00040000 */
#define DCMIPP_PRCR_FORMAT_3              (0x8UL << DCMIPP_PRCR_FORMAT_Pos)          /*!< 0x00080000 */
#define DCMIPP_PRCR_FORMAT_4              (0x10UL << DCMIPP_PRCR_FORMAT_Pos)         /*!< 0x00100000 */
#define DCMIPP_PRCR_FORMAT_5              (0x20UL << DCMIPP_PRCR_FORMAT_Pos)         /*!< 0x00200000 */
#define DCMIPP_PRCR_FORMAT_6              (0x40UL << DCMIPP_PRCR_FORMAT_Pos)         /*!< 0x00400000 */
#define DCMIPP_PRCR_FORMAT_7              (0x80UL << DCMIPP_PRCR_FORMAT_Pos)         /*!< 0x00800000 */
#define DCMIPP_PRCR_SWAPCYCLES_Pos        (25U)
#define DCMIPP_PRCR_SWAPCYCLES_Msk        (0x1UL << DCMIPP_PRCR_SWAPCYCLES_Pos)          /*!< 0x02000000 */
#define DCMIPP_PRCR_SWAPCYCLES            DCMIPP_PRCR_SWAPCYCLES_Msk                    /*!< swap data from cycle 0 vs cycle 1, for pixels received on 2 cycles. */
#define DCMIPP_PRCR_SWAPBITS_Pos          (26U)
#define DCMIPP_PRCR_SWAPBITS_Msk          (0x1UL << DCMIPP_PRCR_SWAPBITS_Pos)            /*!< 0x04000000 */
#define DCMIPP_PRCR_SWAPBITS              DCMIPP_PRCR_SWAPBITS_Msk                      /*!< swap lsb vs msb within each received component. */

/****************  Bit definition for DCMIPP_PRESCR register  *****************/
#define DCMIPP_PRESCR_FSC_Pos             (0U)
#define DCMIPP_PRESCR_FSC_Msk             (0xFFUL << DCMIPP_PRESCR_FSC_Pos)              /*!< 0x000000FF */
#define DCMIPP_PRESCR_FSC                 DCMIPP_PRESCR_FSC_Msk                         /*!< Frame start delimiter code */
#define DCMIPP_PRESCR_FSC_0               (0x1UL << DCMIPP_PRESCR_FSC_Pos)               /*!< 0x00000001 */
#define DCMIPP_PRESCR_FSC_1               (0x2UL << DCMIPP_PRESCR_FSC_Pos)               /*!< 0x00000002 */
#define DCMIPP_PRESCR_FSC_2               (0x4UL << DCMIPP_PRESCR_FSC_Pos)               /*!< 0x00000004 */
#define DCMIPP_PRESCR_FSC_3               (0x8UL << DCMIPP_PRESCR_FSC_Pos)               /*!< 0x00000008 */
#define DCMIPP_PRESCR_FSC_4               (0x10UL << DCMIPP_PRESCR_FSC_Pos)              /*!< 0x00000010 */
#define DCMIPP_PRESCR_FSC_5               (0x20UL << DCMIPP_PRESCR_FSC_Pos)              /*!< 0x00000020 */
#define DCMIPP_PRESCR_FSC_6               (0x40UL << DCMIPP_PRESCR_FSC_Pos)              /*!< 0x00000040 */
#define DCMIPP_PRESCR_FSC_7               (0x80UL << DCMIPP_PRESCR_FSC_Pos)              /*!< 0x00000080 */
#define DCMIPP_PRESCR_LSC_Pos             (8U)
#define DCMIPP_PRESCR_LSC_Msk             (0xFFUL << DCMIPP_PRESCR_LSC_Pos)              /*!< 0x0000FF00 */
#define DCMIPP_PRESCR_LSC                 DCMIPP_PRESCR_LSC_Msk                         /*!< Line start delimiter code */
#define DCMIPP_PRESCR_LSC_0               (0x1UL << DCMIPP_PRESCR_LSC_Pos)             /*!< 0x00000100 */
#define DCMIPP_PRESCR_LSC_1               (0x2UL << DCMIPP_PRESCR_LSC_Pos)             /*!< 0x00000200 */
#define DCMIPP_PRESCR_LSC_2               (0x4UL << DCMIPP_PRESCR_LSC_Pos)             /*!< 0x00000400 */
#define DCMIPP_PRESCR_LSC_3               (0x8UL << DCMIPP_PRESCR_LSC_Pos)             /*!< 0x00000800 */
#define DCMIPP_PRESCR_LSC_4               (0x10UL << DCMIPP_PRESCR_LSC_Pos)            /*!< 0x00001000 */
#define DCMIPP_PRESCR_LSC_5               (0x20UL << DCMIPP_PRESCR_LSC_Pos)            /*!< 0x00002000 */
#define DCMIPP_PRESCR_LSC_6               (0x40UL << DCMIPP_PRESCR_LSC_Pos)            /*!< 0x00004000 */
#define DCMIPP_PRESCR_LSC_7               (0x80UL << DCMIPP_PRESCR_LSC_Pos)            /*!< 0x00008000 */
#define DCMIPP_PRESCR_LEC_Pos             (16U)
#define DCMIPP_PRESCR_LEC_Msk             (0xFFUL << DCMIPP_PRESCR_LEC_Pos)              /*!< 0x00FF0000 */
#define DCMIPP_PRESCR_LEC                 DCMIPP_PRESCR_LEC_Msk                         /*!< Line end delimiter code */
#define DCMIPP_PRESCR_LEC_0               (0x1UL << DCMIPP_PRESCR_LEC_Pos)           /*!< 0x00010000 */
#define DCMIPP_PRESCR_LEC_1               (0x2UL << DCMIPP_PRESCR_LEC_Pos)           /*!< 0x00020000 */
#define DCMIPP_PRESCR_LEC_2               (0x4UL << DCMIPP_PRESCR_LEC_Pos)           /*!< 0x00040000 */
#define DCMIPP_PRESCR_LEC_3               (0x8UL << DCMIPP_PRESCR_LEC_Pos)           /*!< 0x00080000 */
#define DCMIPP_PRESCR_LEC_4               (0x10UL << DCMIPP_PRESCR_LEC_Pos)          /*!< 0x00100000 */
#define DCMIPP_PRESCR_LEC_5               (0x20UL << DCMIPP_PRESCR_LEC_Pos)          /*!< 0x00200000 */
#define DCMIPP_PRESCR_LEC_6               (0x40UL << DCMIPP_PRESCR_LEC_Pos)          /*!< 0x00400000 */
#define DCMIPP_PRESCR_LEC_7               (0x80UL << DCMIPP_PRESCR_LEC_Pos)          /*!< 0x00800000 */
#define DCMIPP_PRESCR_FEC_Pos             (24U)
#define DCMIPP_PRESCR_FEC_Msk             (0xFFUL << DCMIPP_PRESCR_FEC_Pos)              /*!< 0xFF000000 */
#define DCMIPP_PRESCR_FEC                 DCMIPP_PRESCR_FEC_Msk                         /*!< Frame end delimiter code */
#define DCMIPP_PRESCR_FEC_0               (0x1UL << DCMIPP_PRESCR_FEC_Pos)         /*!< 0x01000000 */
#define DCMIPP_PRESCR_FEC_1               (0x2UL << DCMIPP_PRESCR_FEC_Pos)         /*!< 0x02000000 */
#define DCMIPP_PRESCR_FEC_2               (0x4UL << DCMIPP_PRESCR_FEC_Pos)         /*!< 0x04000000 */
#define DCMIPP_PRESCR_FEC_3               (0x8UL << DCMIPP_PRESCR_FEC_Pos)         /*!< 0x08000000 */
#define DCMIPP_PRESCR_FEC_4               (0x10UL << DCMIPP_PRESCR_FEC_Pos)        /*!< 0x10000000 */
#define DCMIPP_PRESCR_FEC_5               (0x20UL << DCMIPP_PRESCR_FEC_Pos)        /*!< 0x20000000 */
#define DCMIPP_PRESCR_FEC_6               (0x40UL << DCMIPP_PRESCR_FEC_Pos)        /*!< 0x40000000 */
#define DCMIPP_PRESCR_FEC_7               (0x80UL << DCMIPP_PRESCR_FEC_Pos)        /*!< 0x80000000 */

/****************  Bit definition for DCMIPP_PRESUR register  *****************/
#define DCMIPP_PRESUR_FSU_Pos             (0U)
#define DCMIPP_PRESUR_FSU_Msk             (0xFFUL << DCMIPP_PRESUR_FSU_Pos)              /*!< 0x000000FF */
#define DCMIPP_PRESUR_FSU                 DCMIPP_PRESUR_FSU_Msk                         /*!< Frame start delimiter unmask */
#define DCMIPP_PRESUR_FSU_0               (0x1UL << DCMIPP_PRESUR_FSU_Pos)               /*!< 0x00000001 */
#define DCMIPP_PRESUR_FSU_1               (0x2UL << DCMIPP_PRESUR_FSU_Pos)               /*!< 0x00000002 */
#define DCMIPP_PRESUR_FSU_2               (0x4UL << DCMIPP_PRESUR_FSU_Pos)               /*!< 0x00000004 */
#define DCMIPP_PRESUR_FSU_3               (0x8UL << DCMIPP_PRESUR_FSU_Pos)               /*!< 0x00000008 */
#define DCMIPP_PRESUR_FSU_4               (0x10UL << DCMIPP_PRESUR_FSU_Pos)              /*!< 0x00000010 */
#define DCMIPP_PRESUR_FSU_5               (0x20UL << DCMIPP_PRESUR_FSU_Pos)              /*!< 0x00000020 */
#define DCMIPP_PRESUR_FSU_6               (0x40UL << DCMIPP_PRESUR_FSU_Pos)              /*!< 0x00000040 */
#define DCMIPP_PRESUR_FSU_7               (0x80UL << DCMIPP_PRESUR_FSU_Pos)              /*!< 0x00000080 */
#define DCMIPP_PRESUR_LSU_Pos             (8U)
#define DCMIPP_PRESUR_LSU_Msk             (0xFFUL << DCMIPP_PRESUR_LSU_Pos)              /*!< 0x0000FF00 */
#define DCMIPP_PRESUR_LSU                 DCMIPP_PRESUR_LSU_Msk                         /*!< Line start delimiter unmask */
#define DCMIPP_PRESUR_LSU_0               (0x1UL << DCMIPP_PRESUR_LSU_Pos)             /*!< 0x00000100 */
#define DCMIPP_PRESUR_LSU_1               (0x2UL << DCMIPP_PRESUR_LSU_Pos)             /*!< 0x00000200 */
#define DCMIPP_PRESUR_LSU_2               (0x4UL << DCMIPP_PRESUR_LSU_Pos)             /*!< 0x00000400 */
#define DCMIPP_PRESUR_LSU_3               (0x8UL << DCMIPP_PRESUR_LSU_Pos)             /*!< 0x00000800 */
#define DCMIPP_PRESUR_LSU_4               (0x10UL << DCMIPP_PRESUR_LSU_Pos)            /*!< 0x00001000 */
#define DCMIPP_PRESUR_LSU_5               (0x20UL << DCMIPP_PRESUR_LSU_Pos)            /*!< 0x00002000 */
#define DCMIPP_PRESUR_LSU_6               (0x40UL << DCMIPP_PRESUR_LSU_Pos)            /*!< 0x00004000 */
#define DCMIPP_PRESUR_LSU_7               (0x80UL << DCMIPP_PRESUR_LSU_Pos)            /*!< 0x00008000 */
#define DCMIPP_PRESUR_LEU_Pos             (16U)
#define DCMIPP_PRESUR_LEU_Msk             (0xFFUL << DCMIPP_PRESUR_LEU_Pos)              /*!< 0x00FF0000 */
#define DCMIPP_PRESUR_LEU                 DCMIPP_PRESUR_LEU_Msk                         /*!< Line end delimiter unmask */
#define DCMIPP_PRESUR_LEU_0               (0x1UL << DCMIPP_PRESUR_LEU_Pos)           /*!< 0x00010000 */
#define DCMIPP_PRESUR_LEU_1               (0x2UL << DCMIPP_PRESUR_LEU_Pos)           /*!< 0x00020000 */
#define DCMIPP_PRESUR_LEU_2               (0x4UL << DCMIPP_PRESUR_LEU_Pos)           /*!< 0x00040000 */
#define DCMIPP_PRESUR_LEU_3               (0x8UL << DCMIPP_PRESUR_LEU_Pos)           /*!< 0x00080000 */
#define DCMIPP_PRESUR_LEU_4               (0x10UL << DCMIPP_PRESUR_LEU_Pos)          /*!< 0x00100000 */
#define DCMIPP_PRESUR_LEU_5               (0x20UL << DCMIPP_PRESUR_LEU_Pos)          /*!< 0x00200000 */
#define DCMIPP_PRESUR_LEU_6               (0x40UL << DCMIPP_PRESUR_LEU_Pos)          /*!< 0x00400000 */
#define DCMIPP_PRESUR_LEU_7               (0x80UL << DCMIPP_PRESUR_LEU_Pos)          /*!< 0x00800000 */
#define DCMIPP_PRESUR_FEU_Pos             (24U)
#define DCMIPP_PRESUR_FEU_Msk             (0xFFUL << DCMIPP_PRESUR_FEU_Pos)              /*!< 0xFF000000 */
#define DCMIPP_PRESUR_FEU                 DCMIPP_PRESUR_FEU_Msk                         /*!< Frame end delimiter unmask */
#define DCMIPP_PRESUR_FEU_0               (0x1UL << DCMIPP_PRESUR_FEU_Pos)         /*!< 0x01000000 */
#define DCMIPP_PRESUR_FEU_1               (0x2UL << DCMIPP_PRESUR_FEU_Pos)         /*!< 0x02000000 */
#define DCMIPP_PRESUR_FEU_2               (0x4UL << DCMIPP_PRESUR_FEU_Pos)         /*!< 0x04000000 */
#define DCMIPP_PRESUR_FEU_3               (0x8UL << DCMIPP_PRESUR_FEU_Pos)         /*!< 0x08000000 */
#define DCMIPP_PRESUR_FEU_4               (0x10UL << DCMIPP_PRESUR_FEU_Pos)        /*!< 0x10000000 */
#define DCMIPP_PRESUR_FEU_5               (0x20UL << DCMIPP_PRESUR_FEU_Pos)        /*!< 0x20000000 */
#define DCMIPP_PRESUR_FEU_6               (0x40UL << DCMIPP_PRESUR_FEU_Pos)        /*!< 0x40000000 */
#define DCMIPP_PRESUR_FEU_7               (0x80UL << DCMIPP_PRESUR_FEU_Pos)        /*!< 0x80000000 */

/*****************  Bit definition for DCMIPP_PRIER register  *****************/
#define DCMIPP_PRIER_ERRIE_Pos            (6U)
#define DCMIPP_PRIER_ERRIE_Msk            (0x1UL << DCMIPP_PRIER_ERRIE_Pos)              /*!< 0x00000040 */
#define DCMIPP_PRIER_ERRIE                DCMIPP_PRIER_ERRIE_Msk                        /*!< Synchronization error interrupt enable */

