zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/********************  Bit definition for ADC_CALFACT register  ********************/
#define ADC_CALFACT_CALFACT_S_Pos         (0U)
#define ADC_CALFACT_CALFACT_S_Msk         (0x7FUL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x0000007F */
#define ADC_CALFACT_CALFACT_S             ADC_CALFACT_CALFACT_S_Msk            /*!< ADC calibration factors in single-ended mode */
#define ADC_CALFACT_CALFACT_S_0           (0x001UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000001 */
#define ADC_CALFACT_CALFACT_S_1           (0x002UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000002 */
#define ADC_CALFACT_CALFACT_S_2           (0x004UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000004 */
#define ADC_CALFACT_CALFACT_S_3           (0x008UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000008 */
#define ADC_CALFACT_CALFACT_S_4           (0x010UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000010 */
#define ADC_CALFACT_CALFACT_S_5           (0x020UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000020 */
#define ADC_CALFACT_CALFACT_S_6           (0x040UL << ADC_CALFACT_CALFACT_S_Pos) /*!< 0x00000040 */
#define ADC_CALFACT_CALFACT_D_Pos         (16U)
#define ADC_CALFACT_CALFACT_D_Msk         (0x7FUL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x007F0000 */
#define ADC_CALFACT_CALFACT_D             ADC_CALFACT_CALFACT_D_Msk            /*!< ADC calibration factors in differential mode */
#define ADC_CALFACT_CALFACT_D_0           (0x001UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00010000 */
#define ADC_CALFACT_CALFACT_D_1           (0x002UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00020000 */
#define ADC_CALFACT_CALFACT_D_2           (0x004UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00040000 */
#define ADC_CALFACT_CALFACT_D_3           (0x008UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00080000 */
#define ADC_CALFACT_CALFACT_D_4           (0x010UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00100000 */
#define ADC_CALFACT_CALFACT_D_5           (0x020UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00200000 */
#define ADC_CALFACT_CALFACT_D_6           (0x040UL << ADC_CALFACT_CALFACT_D_Pos) /*!< 0x00400000 */

/********************  Bit definition for ADC_OR - Option Register  ********************/
#define ADC_OR_OP0_Pos          (0U)
#define ADC_OR_OP0_Msk          (0x1UL << ADC_OR_OP0_Pos) /*!< 0x00000001 */
#define ADC_OR_OP0              ADC_OR_OP0_Msk          /*!< ADC Option Register  - VDDCORE channel enable bit (only for ADC2) */
#define ADC_OR_OP1_Pos          (1U)
#define ADC_OR_OP1_Msk          (0x1UL << ADC_OR_OP1_Pos) /*!< 0x00000002 */
#define ADC_OR_OP1              ADC_OR_OP1_Msk          /*!< ADC Option Register  - VDDCPU channel enable bit (only for ADC2) */
#define ADC_OR_OP2_Pos          (2U)
#define ADC_OR_OP2_Msk          (0x1UL << ADC_OR_OP2_Pos) /*!< 0x00000004 */
#define ADC_OR_OP2              ADC_OR_OP2_Msk          /*!< ADC Option Register  - VDDQ_DDR channel enable bit (only for ADC2) */

/*************************  ADC Common registers  *****************************/
/********************  Bit definition for ADC_CSR register  ********************/
#define ADC_CSR_ADRDY_MST_Pos          (0U)
#define ADC_CSR_ADRDY_MST_Msk          (0x1UL << ADC_CSR_ADRDY_MST_Pos)   /*!< 0x00000001 */
#define ADC_CSR_ADRDY_MST              ADC_CSR_ADRDY_MST_Msk             /*!< Master ADC ready */
#define ADC_CSR_EOSMP_MST_Pos          (1U)
#define ADC_CSR_EOSMP_MST_Msk          (0x1UL << ADC_CSR_EOSMP_MST_Pos) /*!< 0x00000002 */
#define ADC_CSR_EOSMP_MST              ADC_CSR_EOSMP_MST_Msk       /*!< End of sampling phase flag of the master ADC */
#define ADC_CSR_EOC_MST_Pos      (2U)
#define ADC_CSR_EOC_MST_Msk      (0x1UL << ADC_CSR_EOC_MST_Pos) /*!< 0x00000004 */
#define ADC_CSR_EOC_MST          ADC_CSR_EOC_MST_Msk         /*!< End of regular conversion of the master ADC */
#define ADC_CSR_EOS_MST_Pos      (3U)
#define ADC_CSR_EOS_MST_Msk      (0x1UL << ADC_CSR_EOS_MST_Pos) /*!< 0x00000008 */
#define ADC_CSR_EOS_MST          ADC_CSR_EOS_MST_Msk         /*!< End of regular sequence flag of the master ADC */
#define ADC_CSR_OVR_MST_Pos      (4U)
#define ADC_CSR_OVR_MST_Msk      (0x1UL << ADC_CSR_OVR_MST_Pos) /*!< 0x00000010 */
#define ADC_CSR_OVR_MST          ADC_CSR_OVR_MST_Msk         /*!< Overrun flag of the master ADC */
#define ADC_CSR_JEOC_MST_Pos     (5U)
#define ADC_CSR_JEOC_MST_Msk     (0x1UL << ADC_CSR_JEOC_MST_Pos) /*!< 0x00000020 */
#define ADC_CSR_JEOC_MST         ADC_CSR_JEOC_MST_Msk        /*!< End of injected conversion of the master ADC */
#define ADC_CSR_JEOS_MST_Pos     (6U)
#define ADC_CSR_JEOS_MST_Msk     (0x1UL << ADC_CSR_JEOS_MST_Pos) /*!< 0x00000040 */
#define ADC_CSR_JEOS_MST         ADC_CSR_JEOS_MST_Msk        /*!< End of injected sequence flag of the master ADC */
#define ADC_CSR_AWD1_MST_Pos           (7U)
#define ADC_CSR_AWD1_MST_Msk           (0x1UL << ADC_CSR_AWD1_MST_Pos)    /*!< 0x00000080 */
#define ADC_CSR_AWD1_MST               ADC_CSR_AWD1_MST_Msk              /*!< Analog watchdog 1 flag of the master ADC */
#define ADC_CSR_AWD2_MST_Pos           (8U)
#define ADC_CSR_AWD2_MST_Msk           (0x1UL << ADC_CSR_AWD2_MST_Pos)    /*!< 0x00000100 */
#define ADC_CSR_AWD2_MST               ADC_CSR_AWD2_MST_Msk              /*!< Analog watchdog 2 flag of the master ADC */
#define ADC_CSR_AWD3_MST_Pos           (9U)
#define ADC_CSR_AWD3_MST_Msk           (0x1UL << ADC_CSR_AWD3_MST_Pos)    /*!< 0x00000200 */
#define ADC_CSR_AWD3_MST               ADC_CSR_AWD3_MST_Msk              /*!< Analog watchdog 3 flag of the master ADC */
#define ADC_CSR_JQOVF_MST_Pos          (10U)
#define ADC_CSR_JQOVF_MST_Msk          (0x1UL << ADC_CSR_JQOVF_MST_Pos)   /*!< 0x00000400 */
#define ADC_CSR_JQOVF_MST              ADC_CSR_JQOVF_MST_Msk             /*!< Injected context queue overflow flag of the master ADC */

/********************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_CKMODE_Pos                (16U)
#define ADC_CCR_CKMODE_Msk                (0x3UL << ADC_CCR_CKMODE_Pos)         /*!< 0x00030000 */
#define ADC_CCR_CKMODE                    ADC_CCR_CKMODE_Msk                   /*!< ADC clock mode */
#define ADC_CCR_CKMODE_0                  (0x1UL << ADC_CCR_CKMODE_Pos)         /*!< 0x00010000 */
#define ADC_CCR_CKMODE_1                  (0x2UL << ADC_CCR_CKMODE_Pos)         /*!< 0x00020000 */

#define ADC_CCR_PRESC_Pos                 (18U)
#define ADC_CCR_PRESC_Msk                 (0xFUL << ADC_CCR_PRESC_Pos)          /*!< 0x003C0000 */
#define ADC_CCR_PRESC                     ADC_CCR_PRESC_Msk                    /*!< ADC prescaler */
#define ADC_CCR_PRESC_0                   (0x1UL << ADC_CCR_PRESC_Pos)          /*!< 0x00040000 */
#define ADC_CCR_PRESC_1                   (0x2UL << ADC_CCR_PRESC_Pos)          /*!< 0x00080000 */
#define ADC_CCR_PRESC_2                   (0x4UL << ADC_CCR_PRESC_Pos)          /*!< 0x00100000 */
#define ADC_CCR_PRESC_3                   (0x8UL << ADC_CCR_PRESC_Pos)          /*!< 0x00200000 */

#define ADC_CCR_VREFEN_Pos                (22U)
#define ADC_CCR_VREFEN_Msk                (0x1UL << ADC_CCR_VREFEN_Pos)         /*!< 0x00400000 */
#define ADC_CCR_VREFEN                    ADC_CCR_VREFEN_Msk                   /*!< VREFINT enable */
#define ADC_CCR_VSENSEEN_Pos              (23U)
#define ADC_CCR_VSENSEEN_Msk              (0x1UL << ADC_CCR_VSENSEEN_Pos)      /*!< 0x00800000 */
#define ADC_CCR_VSENSEEN                  ADC_CCR_VSENSEEN_Msk                /*!< Temperature sensor enable */
#define ADC_CCR_VBATEN_Pos                (24U)
#define ADC_CCR_VBATEN_Msk                (0x1UL << ADC_CCR_VBATEN_Pos)         /*!< 0x01000000 */
#define ADC_CCR_VBATEN                    ADC_CCR_VBATEN_Msk                   /*!< VBAT enable */

/****************  Bit definition for ADC_HWCFGR0 register  ****************/
#define ADC_HWCFGR0_ADCNUM_Pos            (0U)
#define ADC_HWCFGR0_ADCNUM_Msk            (0xFUL << ADC_HWCFGR0_ADCNUM_Pos)     /*!< 0x0000000F */
#define ADC_HWCFGR0_ADCNUM                ADC_HWCFGR0_ADCNUM_Msk               /*!< Number of ADCs implemented */
#define ADC_HWCFGR0_ADCNUM_0              (0x1UL << ADC_HWCFGR0_ADCNUM_Pos)     /*!< 0x00000001 */
#define ADC_HWCFGR0_ADCNUM_1              (0x2UL << ADC_HWCFGR0_ADCNUM_Pos)     /*!< 0x00000002 */
#define ADC_HWCFGR0_ADCNUM_2              (0x4UL << ADC_HWCFGR0_ADCNUM_Pos)     /*!< 0x00000004 */
#define ADC_HWCFGR0_ADCNUM_3              (0x8UL << ADC_HWCFGR0_ADCNUM_Pos)     /*!< 0x00000008 */
#define ADC_HWCFGR0_MULPIPE_Pos           (4U)
#define ADC_HWCFGR0_MULPIPE_Msk           (0xFUL << ADC_HWCFGR0_MULPIPE_Pos)    /*!< 0x000000F0 */
#define ADC_HWCFGR0_MULPIPE               ADC_HWCFGR0_MULPIPE_Msk              /*!< Number of pipeline stages */
#define ADC_HWCFGR0_MULPIPE_0             (0x1UL << ADC_HWCFGR0_MULPIPE_Pos)    /*!< 0x00000010 */
#define ADC_HWCFGR0_MULPIPE_1             (0x2UL << ADC_HWCFGR0_MULPIPE_Pos)    /*!< 0x00000020 */
#define ADC_HWCFGR0_MULPIPE_2             (0x4UL << ADC_HWCFGR0_MULPIPE_Pos)    /*!< 0x00000040 */
#define ADC_HWCFGR0_MULPIPE_3             (0x8UL << ADC_HWCFGR0_MULPIPE_Pos)    /*!< 0x00000080 */
#define ADC_HWCFGR0_OPBITS_Pos            (8U)
#define ADC_HWCFGR0_OPBITS_Msk            (0xFUL << ADC_HWCFGR0_OPBITS_Pos)     /*!< 0x00000F00 */
#define ADC_HWCFGR0_OPBITS                ADC_HWCFGR0_OPBITS_Msk               /*!< Number of option bits */
#define ADC_HWCFGR0_OPBITS_0              (0x1UL << ADC_HWCFGR0_OPBITS_Pos)     /*!< 0x00000100 */
#define ADC_HWCFGR0_OPBITS_1              (0x2UL << ADC_HWCFGR0_OPBITS_Pos)     /*!< 0x00000200 */
#define ADC_HWCFGR0_OPBITS_2              (0x4UL << ADC_HWCFGR0_OPBITS_Pos)     /*!< 0x00000400 */
#define ADC_HWCFGR0_OPBITS_3              (0x8UL << ADC_HWCFGR0_OPBITS_Pos)     /*!< 0x00000800 */
#define ADC_HWCFGR0_IDLEVALUE_Pos         (12U)
#define ADC_HWCFGR0_IDLEVALUE_Msk         (0xFUL << ADC_HWCFGR0_IDLEVALUE_Pos)  /*!< 0x0000F000 */
#define ADC_HWCFGR0_IDLEVALUE             ADC_HWCFGR0_IDLEVALUE_Msk            /*!< Idle value for non-selected channels */
#define ADC_HWCFGR0_IDLEVALUE_0           (0x1UL << ADC_HWCFGR0_IDLEVALUE_Pos)  /*!< 0x00001000 */
#define ADC_HWCFGR0_IDLEVALUE_1           (0x2UL << ADC_HWCFGR0_IDLEVALUE_Pos)  /*!< 0x00002000 */
#define ADC_HWCFGR0_IDLEVALUE_2           (0x4UL << ADC_HWCFGR0_IDLEVALUE_Pos)  /*!< 0x00004000 */
#define ADC_HWCFGR0_IDLEVALUE_3           (0x8UL << ADC_HWCFGR0_IDLEVALUE_Pos)  /*!< 0x00008000 */

/*****************  Bit definition for ADC_VERR register  ******************/
#define ADC_VERR_MINREV_Pos               (0U)
#define ADC_VERR_MINREV_Msk               (0xFUL << ADC_VERR_MINREV_Pos)        /*!< 0x0000000F */
#define ADC_VERR_MINREV                   ADC_VERR_MINREV_Msk                  /*!< Minor revision */
#define ADC_VERR_MINREV_0                 (0x1UL << ADC_VERR_MINREV_Pos)        /*!< 0x00000001 */
#define ADC_VERR_MINREV_1                 (0x2UL << ADC_VERR_MINREV_Pos)        /*!< 0x00000002 */
#define ADC_VERR_MINREV_2                 (0x4UL << ADC_VERR_MINREV_Pos)        /*!< 0x00000004 */
#define ADC_VERR_MINREV_3                 (0x8UL << ADC_VERR_MINREV_Pos)        /*!< 0x00000008 */
#define ADC_VERR_MAJREV_Pos               (4U)
#define ADC_VERR_MAJREV_Msk               (0xFUL << ADC_VERR_MAJREV_Pos)        /*!< 0x000000F0 */
#define ADC_VERR_MAJREV                   ADC_VERR_MAJREV_Msk                  /*!< Major revision */
#define ADC_VERR_MAJREV_0                 (0x1UL << ADC_VERR_MAJREV_Pos)        /*!< 0x00000010 */
#define ADC_VERR_MAJREV_1                 (0x2UL << ADC_VERR_MAJREV_Pos)        /*!< 0x00000020 */
#define ADC_VERR_MAJREV_2                 (0x4UL << ADC_VERR_MAJREV_Pos)        /*!< 0x00000040 */
#define ADC_VERR_MAJREV_3                 (0x8UL << ADC_VERR_MAJREV_Pos)        /*!< 0x00000080 */

/*****************  Bit definition for ADC_IPDR register  ******************/
#define ADC_IPDR_ID_Pos                   (0U)
#define ADC_IPDR_ID_Msk                   (0xFFFFFFFFUL << ADC_IPDR_ID_Pos)     /*!< 0xFFFFFFFF */
#define ADC_IPDR_ID                       ADC_IPDR_ID_Msk                      /*!< Peripheral identifier */
#define ADC_IPDR_ID_0                     (0x1UL << ADC_IPDR_ID_Pos)            /*!< 0x00000001 */
#define ADC_IPDR_ID_1                     (0x2UL << ADC_IPDR_ID_Pos)            /*!< 0x00000002 */
#define ADC_IPDR_ID_2                     (0x4UL << ADC_IPDR_ID_Pos)            /*!< 0x00000004 */
#define ADC_IPDR_ID_3                     (0x8UL << ADC_IPDR_ID_Pos)            /*!< 0x00000008 */
#define ADC_IPDR_ID_4                     (0x10UL << ADC_IPDR_ID_Pos)           /*!< 0x00000010 */
#define ADC_IPDR_ID_5                     (0x20UL << ADC_IPDR_ID_Pos)           /*!< 0x00000020 */
#define ADC_IPDR_ID_6                     (0x40UL << ADC_IPDR_ID_Pos)           /*!< 0x00000040 */
#define ADC_IPDR_ID_7                     (0x80UL << ADC_IPDR_ID_Pos)           /*!< 0x00000080 */
#define ADC_IPDR_ID_8                     (0x100UL << ADC_IPDR_ID_Pos)          /*!< 0x00000100 */
#define ADC_IPDR_ID_9                     (0x200UL << ADC_IPDR_ID_Pos)          /*!< 0x00000200 */
#define ADC_IPDR_ID_10                    (0x400UL << ADC_IPDR_ID_Pos)          /*!< 0x00000400 */
#define ADC_IPDR_ID_11                    (0x800UL << ADC_IPDR_ID_Pos)          /*!< 0x00000800 */
#define ADC_IPDR_ID_12                    (0x1000UL << ADC_IPDR_ID_Pos)         /*!< 0x00001000 */
#define ADC_IPDR_ID_13                    (0x2000UL << ADC_IPDR_ID_Pos)         /*!< 0x00002000 */
#define ADC_IPDR_ID_14                    (0x4000UL << ADC_IPDR_ID_Pos)         /*!< 0x00004000 */
#define ADC_IPDR_ID_15                    (0x8000UL << ADC_IPDR_ID_Pos)         /*!< 0x00008000 */
#define ADC_IPDR_ID_16                    (0x10000UL << ADC_IPDR_ID_Pos)        /*!< 0x00010000 */
#define ADC_IPDR_ID_17                    (0x20000UL << ADC_IPDR_ID_Pos)        /*!< 0x00020000 */
#define ADC_IPDR_ID_18                    (0x40000UL << ADC_IPDR_ID_Pos)        /*!< 0x00040000 */
#define ADC_IPDR_ID_19                    (0x80000UL << ADC_IPDR_ID_Pos)        /*!< 0x00080000 */
#define ADC_IPDR_ID_20                    (0x100000UL << ADC_IPDR_ID_Pos)       /*!< 0x00100000 */
#define ADC_IPDR_ID_21                    (0x200000UL << ADC_IPDR_ID_Pos)       /*!< 0x00200000 */
#define ADC_IPDR_ID_22                    (0x400000UL << ADC_IPDR_ID_Pos)       /*!< 0x00400000 */
#define ADC_IPDR_ID_23                    (0x800000UL << ADC_IPDR_ID_Pos)       /*!< 0x00800000 */
#define ADC_IPDR_ID_24                    (0x1000000UL << ADC_IPDR_ID_Pos)      /*!< 0x01000000 */
#define ADC_IPDR_ID_25                    (0x2000000UL << ADC_IPDR_ID_Pos)      /*!< 0x02000000 */
#define ADC_IPDR_ID_26                    (0x4000000UL << ADC_IPDR_ID_Pos)      /*!< 0x04000000 */
#define ADC_IPDR_ID_27                    (0x8000000UL << ADC_IPDR_ID_Pos)      /*!< 0x08000000 */
#define ADC_IPDR_ID_28                    (0x10000000UL << ADC_IPDR_ID_Pos)     /*!< 0x10000000 */
#define ADC_IPDR_ID_29                    (0x20000000UL << ADC_IPDR_ID_Pos)     /*!< 0x20000000 */
#define ADC_IPDR_ID_30                    (0x40000000UL << ADC_IPDR_ID_Pos)     /*!< 0x40000000 */
#define ADC_IPDR_ID_31                    (0x80000000UL << ADC_IPDR_ID_Pos)     /*!< 0x80000000 */

