zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/***************  Bit definition for DDRCTRL_PCFGW_0 register  ****************/
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos     (0U)
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Msk     (0x3FFUL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)   /*!< 0x000003FF */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY         DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Msk               /*!< Determines the initial load value of write aging counters. These counters are parallel loaded after reset, or after each grant to the corresponding port. The aging counters down-count every clock cycle where the port is requesting but not granted. The higher significant 5-bits of the write aging counter sets the initial priority of the write channel of a given port. Port\qs priority increases as the higher significant 5-bits of the counter starts to decrease. When the aging counter becomes 0, the corresponding port channel has the highest priority level. */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_0       (0x1UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)     /*!< 0x00000001 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_1       (0x2UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)     /*!< 0x00000002 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_2       (0x4UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)     /*!< 0x00000004 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_3       (0x8UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)     /*!< 0x00000008 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_4       (0x10UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)    /*!< 0x00000010 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_5       (0x20UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)    /*!< 0x00000020 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_6       (0x40UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)    /*!< 0x00000040 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_7       (0x80UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)    /*!< 0x00000080 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_8       (0x100UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)   /*!< 0x00000100 */
#define DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_9       (0x200UL << DDRCTRL_PCFGW_0_WR_PORT_PRIORITY_Pos)   /*!< 0x00000200 */
#define DDRCTRL_PCFGW_0_WR_PORT_AGING_EN_Pos     (12U)
#define DDRCTRL_PCFGW_0_WR_PORT_AGING_EN_Msk     (0x1UL << DDRCTRL_PCFGW_0_WR_PORT_AGING_EN_Pos)     /*!< 0x00001000 */
#define DDRCTRL_PCFGW_0_WR_PORT_AGING_EN         DDRCTRL_PCFGW_0_WR_PORT_AGING_EN_Msk               /*!< If set to 1, enables aging function for the write channel of the port. */
#define DDRCTRL_PCFGW_0_WR_PORT_URGENT_EN_Pos    (13U)
#define DDRCTRL_PCFGW_0_WR_PORT_URGENT_EN_Msk    (0x1UL << DDRCTRL_PCFGW_0_WR_PORT_URGENT_EN_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PCFGW_0_WR_PORT_URGENT_EN        DDRCTRL_PCFGW_0_WR_PORT_URGENT_EN_Msk              /*!< If set to 1, enables the AXI urgent sideband signal (awurgent). When enabled and awurgent is asserted by the master, that port becomes the highest priority and co_gs_go2critical_wr signal to DDRC is asserted if enabled in PCCFG.go2critical_en register. */
#define DDRCTRL_PCFGW_0_WR_PORT_PAGEMATCH_EN_Pos (14U)
#define DDRCTRL_PCFGW_0_WR_PORT_PAGEMATCH_EN_Msk (0x1UL << DDRCTRL_PCFGW_0_WR_PORT_PAGEMATCH_EN_Pos) /*!< 0x00004000 */
#define DDRCTRL_PCFGW_0_WR_PORT_PAGEMATCH_EN     DDRCTRL_PCFGW_0_WR_PORT_PAGEMATCH_EN_Msk           /*!< If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted, the port is continued to be granted if the following immediate commands are to the same memory page (same bank and same row). See also related PCCFG.pagematch_limit register. */

/***************  Bit definition for DDRCTRL_PCTRL_0 register  ****************/
#define DDRCTRL_PCTRL_0_PORT_EN_Pos (0U)
#define DDRCTRL_PCTRL_0_PORT_EN_Msk (0x1UL << DDRCTRL_PCTRL_0_PORT_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_PCTRL_0_PORT_EN     DDRCTRL_PCTRL_0_PORT_EN_Msk           /*!< Enables AXI port n. */

/**************  Bit definition for DDRCTRL_PCFGQOS0_0 register  **************/
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos  (0U)
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Msk  (0xFUL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos)  /*!< 0x0000000F */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1      DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Msk            /*!< Separation level1 indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 (for dual RAQ) or 0 to 14 (for single RAQ) which corresponds to arqos. */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_0    (0x1UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000001 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_1    (0x2UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000002 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_2    (0x4UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000004 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_3    (0x8UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000008 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos  (8U)
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Msk  (0xFUL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000F00 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2      DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Msk            /*!< Separation level2 indicating the end of region1 mapping; start of region1 is (level1 + 1). Possible values for level2 are (level1 + 1) to 14 which corresponds to arqos. */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_0    (0x1UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000100 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_1    (0x2UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000200 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_2    (0x4UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000400 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_3    (0x8UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000800 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Pos (16U)
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Msk (0x3UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Pos) /*!< 0x00030000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0     DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Msk           /*!< This bitfield indicates the traffic class of region 0. */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_0   (0x1UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Pos) /*!< 0x00010000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_1   (0x2UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION0_Pos) /*!< 0x00020000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Pos (20U)
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Msk (0x3UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Pos) /*!< 0x00300000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1     DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Msk           /*!< This bitfield indicates the traffic class of region 1. */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_0   (0x1UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Pos) /*!< 0x00100000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_1   (0x2UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION1_Pos) /*!< 0x00200000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Pos (24U)
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Msk (0x3UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Pos) /*!< 0x03000000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2     DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Msk           /*!< This bitfield indicates the traffic class of region2. */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_0   (0x1UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_1   (0x2UL << DDRCTRL_PCFGQOS0_0_RQOS_MAP_REGION2_Pos) /*!< 0x02000000 */

/**************  Bit definition for DDRCTRL_PCFGQOS1_0 register  **************/
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos (0U)
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Msk (0x7FFUL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x000007FF */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB     DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Msk             /*!< Specifies the timeout value for transactions mapped to the blue address queue. */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_0   (0x1UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000001 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_1   (0x2UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000002 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_2   (0x4UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000004 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_3   (0x8UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)   /*!< 0x00000008 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_4   (0x10UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000010 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_5   (0x20UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000020 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_6   (0x40UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000040 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_7   (0x80UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos)  /*!< 0x00000080 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_8   (0x100UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000100 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_9   (0x200UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000200 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_10  (0x400UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTB_Pos) /*!< 0x00000400 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos (16U)
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Msk (0x7FFUL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x07FF0000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR     DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Msk             /*!< Specifies the timeout value for transactions mapped to the red address queue. */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_0   (0x1UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00010000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_1   (0x2UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00020000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_2   (0x4UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00040000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_3   (0x8UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)   /*!< 0x00080000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_4   (0x10UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00100000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_5   (0x20UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00200000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_6   (0x40UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00400000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_7   (0x80UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos)  /*!< 0x00800000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_8   (0x100UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_9   (0x200UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x02000000 */
#define DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_10  (0x400UL << DDRCTRL_PCFGQOS1_0_RQOS_MAP_TIMEOUTR_Pos) /*!< 0x04000000 */

/*************  Bit definition for DDRCTRL_PCFGWQOS0_0 register  **************/
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos  (0U)
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Msk  (0xFUL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos)  /*!< 0x0000000F */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1      DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Msk            /*!< Separation level indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 which corresponds to awqos. */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_0    (0x1UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000001 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_1    (0x2UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000002 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_2    (0x4UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000004 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_3    (0x8UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL1_Pos)  /*!< 0x00000008 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos  (8U)
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Msk  (0xFUL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000F00 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2      DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Msk            /*!< Separation level2 indicating the end of region1 mapping; start of region1 is (level1 + 1). Possible values for level2 are (level1 + 1) to 14 which corresponds to awqos. */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_0    (0x1UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000100 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_1    (0x2UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000200 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_2    (0x4UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000400 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_3    (0x8UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_LEVEL2_Pos)  /*!< 0x00000800 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Pos (16U)
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Msk (0x3UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Pos) /*!< 0x00030000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0     DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Msk           /*!< This bitfield indicates the traffic class of region 0. */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_0   (0x1UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Pos) /*!< 0x00010000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_1   (0x2UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION0_Pos) /*!< 0x00020000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Pos (20U)
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Msk (0x3UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Pos) /*!< 0x00300000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1     DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Msk           /*!< This bitfield indicates the traffic class of region 1. */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_0   (0x1UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Pos) /*!< 0x00100000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_1   (0x2UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION1_Pos) /*!< 0x00200000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Pos (24U)
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Msk (0x3UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Pos) /*!< 0x03000000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2     DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Msk           /*!< This bitfield indicates the traffic class of region 2. */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_0   (0x1UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_1   (0x2UL << DDRCTRL_PCFGWQOS0_0_WQOS_MAP_REGION2_Pos) /*!< 0x02000000 */

/*************  Bit definition for DDRCTRL_PCFGWQOS1_0 register  **************/
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos (0U)
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Msk (0x7FFUL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x000007FF */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1     DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Msk             /*!< Specifies the timeout value for write transactions in region 0 and 1. */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_0   (0x1UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000001 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_1   (0x2UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000002 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_2   (0x4UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000004 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_3   (0x8UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)   /*!< 0x00000008 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_4   (0x10UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000010 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_5   (0x20UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000020 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_6   (0x40UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000040 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_7   (0x80UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos)  /*!< 0x00000080 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_8   (0x100UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000100 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_9   (0x200UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000200 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_10  (0x400UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT1_Pos) /*!< 0x00000400 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos (16U)
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Msk (0x7FFUL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x07FF0000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2     DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Msk             /*!< Specifies the timeout value for write transactions in region 2. */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_0   (0x1UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00010000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_1   (0x2UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00020000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_2   (0x4UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00040000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_3   (0x8UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)   /*!< 0x00080000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_4   (0x10UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00100000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_5   (0x20UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00200000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_6   (0x40UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00400000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_7   (0x80UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos)  /*!< 0x00800000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_8   (0x100UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_9   (0x200UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x02000000 */
#define DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_10  (0x400UL << DDRCTRL_PCFGWQOS1_0_WQOS_MAP_TIMEOUT2_Pos) /*!< 0x04000000 */

/******************************************************************************/
/*                                                                            */
/*                   DDRPERFM block description (DDRPERFM)                    */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for DDRPERFM_CTL register  *****************/
#define DDRPERFM_CTL_START_Pos (0U)
#define DDRPERFM_CTL_START_Msk (0x1UL << DDRPERFM_CTL_START_Pos) /*!< 0x00000001 */
#define DDRPERFM_CTL_START     DDRPERFM_CTL_START_Msk           /*!< Start counters which are enabled, the time counter (TCNT) is always enabled. */
#define DDRPERFM_CTL_STOP_Pos  (1U)
#define DDRPERFM_CTL_STOP_Msk  (0x1UL << DDRPERFM_CTL_STOP_Pos)  /*!< 0x00000002 */
#define DDRPERFM_CTL_STOP      DDRPERFM_CTL_STOP_Msk            /*!< stop all the counters. */

