zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/*****************  Bit definition for DDRPERFM_CFG register  *****************/
#define DDRPERFM_CFG_EN_Pos  (0U)
#define DDRPERFM_CFG_EN_Msk  (0xFUL << DDRPERFM_CFG_EN_Pos)  /*!< 0x0000000F */
#define DDRPERFM_CFG_EN      DDRPERFM_CFG_EN_Msk            /*!< enable counter x (from 0 to 3) */
#define DDRPERFM_CFG_EN_0    (0x1UL << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000001 */
#define DDRPERFM_CFG_EN_1    (0x2UL << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000002 */
#define DDRPERFM_CFG_EN_2    (0x4UL << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000004 */
#define DDRPERFM_CFG_EN_3    (0x8UL << DDRPERFM_CFG_EN_Pos)  /*!< 0x00000008 */
#define DDRPERFM_CFG_SEL_Pos (16U)
#define DDRPERFM_CFG_SEL_Msk (0x3UL << DDRPERFM_CFG_SEL_Pos) /*!< 0x00030000 */
#define DDRPERFM_CFG_SEL     DDRPERFM_CFG_SEL_Msk           /*!< select set of signals to be monitored (from 0 to 3) (see signal set description in Table 34: DDRPERFM signal sets) and counters to be enabled */
#define DDRPERFM_CFG_SEL_0   (0x1UL << DDRPERFM_CFG_SEL_Pos) /*!< 0x00010000 */
#define DDRPERFM_CFG_SEL_1   (0x2UL << DDRPERFM_CFG_SEL_Pos) /*!< 0x00020000 */

/***************  Bit definition for DDRPERFM_STATUS register  ****************/
#define DDRPERFM_STATUS_COVF_Pos (0U)
#define DDRPERFM_STATUS_COVF_Msk (0xFUL << DDRPERFM_STATUS_COVF_Pos) /*!< 0x0000000F */
#define DDRPERFM_STATUS_COVF     DDRPERFM_STATUS_COVF_Msk           /*!< Counter x Overflow (with x from 0 to 3) */
#define DDRPERFM_STATUS_COVF_0   (0x1UL << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000001 */
#define DDRPERFM_STATUS_COVF_1   (0x2UL << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000002 */
#define DDRPERFM_STATUS_COVF_2   (0x4UL << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000004 */
#define DDRPERFM_STATUS_COVF_3   (0x8UL << DDRPERFM_STATUS_COVF_Pos) /*!< 0x00000008 */
#define DDRPERFM_STATUS_BUSY_Pos (16U)
#define DDRPERFM_STATUS_BUSY_Msk (0x1UL << DDRPERFM_STATUS_BUSY_Pos) /*!< 0x00010000 */
#define DDRPERFM_STATUS_BUSY     DDRPERFM_STATUS_BUSY_Msk           /*!< Busy Status */
#define DDRPERFM_STATUS_TOVF_Pos (31U)
#define DDRPERFM_STATUS_TOVF_Msk (0x1UL << DDRPERFM_STATUS_TOVF_Pos) /*!< 0x80000000 */
#define DDRPERFM_STATUS_TOVF     DDRPERFM_STATUS_TOVF_Msk           /*!< total counter overflow */

/*****************  Bit definition for DDRPERFM_CCR register  *****************/
#define DDRPERFM_CCR_CCLR_Pos (0U)
#define DDRPERFM_CCR_CCLR_Msk (0xFUL << DDRPERFM_CCR_CCLR_Pos) /*!< 0x0000000F */
#define DDRPERFM_CCR_CCLR     DDRPERFM_CCR_CCLR_Msk           /*!< counter x Clear (with x from 0 to 3) */
#define DDRPERFM_CCR_CCLR_0   (0x1UL << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000001 */
#define DDRPERFM_CCR_CCLR_1   (0x2UL << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000002 */
#define DDRPERFM_CCR_CCLR_2   (0x4UL << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000004 */
#define DDRPERFM_CCR_CCLR_3   (0x8UL << DDRPERFM_CCR_CCLR_Pos) /*!< 0x00000008 */
#define DDRPERFM_CCR_TCLR_Pos (31U)
#define DDRPERFM_CCR_TCLR_Msk (0x1UL << DDRPERFM_CCR_TCLR_Pos) /*!< 0x80000000 */
#define DDRPERFM_CCR_TCLR     DDRPERFM_CCR_TCLR_Msk           /*!< time counter clear */

/*****************  Bit definition for DDRPERFM_IER register  *****************/
#define DDRPERFM_IER_OVFIE_Pos (0U)
#define DDRPERFM_IER_OVFIE_Msk (0x1UL << DDRPERFM_IER_OVFIE_Pos) /*!< 0x00000001 */
#define DDRPERFM_IER_OVFIE     DDRPERFM_IER_OVFIE_Msk           /*!< overflow interrupt enable */

/*****************  Bit definition for DDRPERFM_ISR register  *****************/
#define DDRPERFM_ISR_OVFF_Pos (0U)
#define DDRPERFM_ISR_OVFF_Msk (0x1UL << DDRPERFM_ISR_OVFF_Pos) /*!< 0x00000001 */
#define DDRPERFM_ISR_OVFF     DDRPERFM_ISR_OVFF_Msk           /*!< overflow flag */

/*****************  Bit definition for DDRPERFM_ICR register  *****************/
#define DDRPERFM_ICR_OVF_Pos (0U)
#define DDRPERFM_ICR_OVF_Msk (0x1UL << DDRPERFM_ICR_OVF_Pos) /*!< 0x00000001 */
#define DDRPERFM_ICR_OVF     DDRPERFM_ICR_OVF_Msk           /*!< overflow flag */

/****************  Bit definition for DDRPERFM_TCNT register  *****************/
#define DDRPERFM_TCNT_CNT_Pos (0U)
#define DDRPERFM_TCNT_CNT_Msk (0xFFFFFFFFUL << DDRPERFM_TCNT_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_TCNT_CNT     DDRPERFM_TCNT_CNT_Msk                  /*!< total time, this is number of DDR controller clocks elapsed while DDRPERFM has been running. */
#define DDRPERFM_TCNT_CNT_0   (0x1UL << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_TCNT_CNT_1   (0x2UL << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_TCNT_CNT_2   (0x4UL << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_TCNT_CNT_3   (0x8UL << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_TCNT_CNT_4   (0x10UL << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_TCNT_CNT_5   (0x20UL << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_TCNT_CNT_6   (0x40UL << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_TCNT_CNT_7   (0x80UL << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_TCNT_CNT_8   (0x100UL << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_TCNT_CNT_9   (0x200UL << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_TCNT_CNT_10  (0x400UL << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_TCNT_CNT_11  (0x800UL << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_TCNT_CNT_12  (0x1000UL << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_TCNT_CNT_13  (0x2000UL << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_TCNT_CNT_14  (0x4000UL << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_TCNT_CNT_15  (0x8000UL << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_TCNT_CNT_16  (0x10000UL << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_TCNT_CNT_17  (0x20000UL << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_TCNT_CNT_18  (0x40000UL << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_TCNT_CNT_19  (0x80000UL << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_TCNT_CNT_20  (0x100000UL << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_TCNT_CNT_21  (0x200000UL << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_TCNT_CNT_22  (0x400000UL << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_TCNT_CNT_23  (0x800000UL << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_TCNT_CNT_24  (0x1000000UL << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_TCNT_CNT_25  (0x2000000UL << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_TCNT_CNT_26  (0x4000000UL << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_TCNT_CNT_27  (0x8000000UL << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_TCNT_CNT_28  (0x10000000UL << DDRPERFM_TCNT_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_TCNT_CNT_29  (0x20000000UL << DDRPERFM_TCNT_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_TCNT_CNT_30  (0x40000000UL << DDRPERFM_TCNT_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_TCNT_CNT_31  (0x80000000UL << DDRPERFM_TCNT_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT0 register  *****************/
#define DDRPERFM_CNT0_CNT_Pos (0U)
#define DDRPERFM_CNT0_CNT_Msk (0xFFFFFFFFUL << DDRPERFM_CNT0_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT0_CNT     DDRPERFM_CNT0_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT0_CNT_0   (0x1UL << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT0_CNT_1   (0x2UL << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT0_CNT_2   (0x4UL << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT0_CNT_3   (0x8UL << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT0_CNT_4   (0x10UL << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT0_CNT_5   (0x20UL << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT0_CNT_6   (0x40UL << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT0_CNT_7   (0x80UL << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT0_CNT_8   (0x100UL << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT0_CNT_9   (0x200UL << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT0_CNT_10  (0x400UL << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT0_CNT_11  (0x800UL << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT0_CNT_12  (0x1000UL << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT0_CNT_13  (0x2000UL << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT0_CNT_14  (0x4000UL << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT0_CNT_15  (0x8000UL << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT0_CNT_16  (0x10000UL << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT0_CNT_17  (0x20000UL << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT0_CNT_18  (0x40000UL << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT0_CNT_19  (0x80000UL << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT0_CNT_20  (0x100000UL << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT0_CNT_21  (0x200000UL << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT0_CNT_22  (0x400000UL << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT0_CNT_23  (0x800000UL << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT0_CNT_24  (0x1000000UL << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT0_CNT_25  (0x2000000UL << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT0_CNT_26  (0x4000000UL << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT0_CNT_27  (0x8000000UL << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT0_CNT_28  (0x10000000UL << DDRPERFM_CNT0_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT0_CNT_29  (0x20000000UL << DDRPERFM_CNT0_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT0_CNT_30  (0x40000000UL << DDRPERFM_CNT0_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT0_CNT_31  (0x80000000UL << DDRPERFM_CNT0_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT1 register  *****************/
#define DDRPERFM_CNT1_CNT_Pos (0U)
#define DDRPERFM_CNT1_CNT_Msk (0xFFFFFFFFUL << DDRPERFM_CNT1_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT1_CNT     DDRPERFM_CNT1_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT1_CNT_0   (0x1UL << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT1_CNT_1   (0x2UL << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT1_CNT_2   (0x4UL << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT1_CNT_3   (0x8UL << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT1_CNT_4   (0x10UL << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT1_CNT_5   (0x20UL << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT1_CNT_6   (0x40UL << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT1_CNT_7   (0x80UL << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT1_CNT_8   (0x100UL << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT1_CNT_9   (0x200UL << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT1_CNT_10  (0x400UL << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT1_CNT_11  (0x800UL << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT1_CNT_12  (0x1000UL << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT1_CNT_13  (0x2000UL << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT1_CNT_14  (0x4000UL << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT1_CNT_15  (0x8000UL << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT1_CNT_16  (0x10000UL << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT1_CNT_17  (0x20000UL << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT1_CNT_18  (0x40000UL << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT1_CNT_19  (0x80000UL << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT1_CNT_20  (0x100000UL << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT1_CNT_21  (0x200000UL << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT1_CNT_22  (0x400000UL << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT1_CNT_23  (0x800000UL << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT1_CNT_24  (0x1000000UL << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT1_CNT_25  (0x2000000UL << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT1_CNT_26  (0x4000000UL << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT1_CNT_27  (0x8000000UL << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT1_CNT_28  (0x10000000UL << DDRPERFM_CNT1_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT1_CNT_29  (0x20000000UL << DDRPERFM_CNT1_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT1_CNT_30  (0x40000000UL << DDRPERFM_CNT1_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT1_CNT_31  (0x80000000UL << DDRPERFM_CNT1_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT2 register  *****************/
#define DDRPERFM_CNT2_CNT_Pos (0U)
#define DDRPERFM_CNT2_CNT_Msk (0xFFFFFFFFUL << DDRPERFM_CNT2_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT2_CNT     DDRPERFM_CNT2_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT2_CNT_0   (0x1UL << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT2_CNT_1   (0x2UL << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT2_CNT_2   (0x4UL << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT2_CNT_3   (0x8UL << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT2_CNT_4   (0x10UL << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT2_CNT_5   (0x20UL << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT2_CNT_6   (0x40UL << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT2_CNT_7   (0x80UL << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT2_CNT_8   (0x100UL << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT2_CNT_9   (0x200UL << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT2_CNT_10  (0x400UL << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT2_CNT_11  (0x800UL << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT2_CNT_12  (0x1000UL << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT2_CNT_13  (0x2000UL << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT2_CNT_14  (0x4000UL << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT2_CNT_15  (0x8000UL << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT2_CNT_16  (0x10000UL << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT2_CNT_17  (0x20000UL << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT2_CNT_18  (0x40000UL << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT2_CNT_19  (0x80000UL << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT2_CNT_20  (0x100000UL << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT2_CNT_21  (0x200000UL << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT2_CNT_22  (0x400000UL << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT2_CNT_23  (0x800000UL << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT2_CNT_24  (0x1000000UL << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT2_CNT_25  (0x2000000UL << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT2_CNT_26  (0x4000000UL << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT2_CNT_27  (0x8000000UL << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT2_CNT_28  (0x10000000UL << DDRPERFM_CNT2_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT2_CNT_29  (0x20000000UL << DDRPERFM_CNT2_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT2_CNT_30  (0x40000000UL << DDRPERFM_CNT2_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT2_CNT_31  (0x80000000UL << DDRPERFM_CNT2_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT3 register  *****************/
#define DDRPERFM_CNT3_CNT_Pos (0U)
#define DDRPERFM_CNT3_CNT_Msk (0xFFFFFFFFUL << DDRPERFM_CNT3_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT3_CNT     DDRPERFM_CNT3_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT3_CNT_0   (0x1UL << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT3_CNT_1   (0x2UL << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT3_CNT_2   (0x4UL << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT3_CNT_3   (0x8UL << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT3_CNT_4   (0x10UL << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT3_CNT_5   (0x20UL << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT3_CNT_6   (0x40UL << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT3_CNT_7   (0x80UL << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT3_CNT_8   (0x100UL << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT3_CNT_9   (0x200UL << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT3_CNT_10  (0x400UL << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT3_CNT_11  (0x800UL << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT3_CNT_12  (0x1000UL << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT3_CNT_13  (0x2000UL << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT3_CNT_14  (0x4000UL << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT3_CNT_15  (0x8000UL << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT3_CNT_16  (0x10000UL << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT3_CNT_17  (0x20000UL << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT3_CNT_18  (0x40000UL << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT3_CNT_19  (0x80000UL << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT3_CNT_20  (0x100000UL << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT3_CNT_21  (0x200000UL << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT3_CNT_22  (0x400000UL << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT3_CNT_23  (0x800000UL << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT3_CNT_24  (0x1000000UL << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT3_CNT_25  (0x2000000UL << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT3_CNT_26  (0x4000000UL << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT3_CNT_27  (0x8000000UL << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT3_CNT_28  (0x10000000UL << DDRPERFM_CNT3_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT3_CNT_29  (0x20000000UL << DDRPERFM_CNT3_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT3_CNT_30  (0x40000000UL << DDRPERFM_CNT3_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT3_CNT_31  (0x80000000UL << DDRPERFM_CNT3_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_HWCFG register  ****************/
#define DDRPERFM_HWCFG_NCNT_Pos (0U)
#define DDRPERFM_HWCFG_NCNT_Msk (0xFUL << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x0000000F */
#define DDRPERFM_HWCFG_NCNT     DDRPERFM_HWCFG_NCNT_Msk           /*!< number of counters for this configuration (4) */
#define DDRPERFM_HWCFG_NCNT_0   (0x1UL << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000001 */
#define DDRPERFM_HWCFG_NCNT_1   (0x2UL << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000002 */
#define DDRPERFM_HWCFG_NCNT_2   (0x4UL << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000004 */
#define DDRPERFM_HWCFG_NCNT_3   (0x8UL << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000008 */

