zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/***************  Bit definition for DDRPHYC_DX0DQTR register  ****************/
#define DDRPHYC_DX0DQTR_DQDLY0_Pos (0U)
#define DDRPHYC_DX0DQTR_DQDLY0_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY0_Pos) /*!< 0x0000000F */
#define DDRPHYC_DX0DQTR_DQDLY0     DDRPHYC_DX0DQTR_DQDLY0_Msk           /*!< DQ delay for bit 0 */
#define DDRPHYC_DX0DQTR_DQDLY0_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY0_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX0DQTR_DQDLY0_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY0_Pos) /*!< 0x00000002 */
#define DDRPHYC_DX0DQTR_DQDLY0_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY0_Pos) /*!< 0x00000004 */
#define DDRPHYC_DX0DQTR_DQDLY0_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY0_Pos) /*!< 0x00000008 */
#define DDRPHYC_DX0DQTR_DQDLY1_Pos (4U)
#define DDRPHYC_DX0DQTR_DQDLY1_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY1_Pos) /*!< 0x000000F0 */
#define DDRPHYC_DX0DQTR_DQDLY1     DDRPHYC_DX0DQTR_DQDLY1_Msk           /*!< DQ delay for bit 1 */
#define DDRPHYC_DX0DQTR_DQDLY1_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY1_Pos) /*!< 0x00000010 */
#define DDRPHYC_DX0DQTR_DQDLY1_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY1_Pos) /*!< 0x00000020 */
#define DDRPHYC_DX0DQTR_DQDLY1_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY1_Pos) /*!< 0x00000040 */
#define DDRPHYC_DX0DQTR_DQDLY1_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY1_Pos) /*!< 0x00000080 */
#define DDRPHYC_DX0DQTR_DQDLY2_Pos (8U)
#define DDRPHYC_DX0DQTR_DQDLY2_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY2_Pos) /*!< 0x00000F00 */
#define DDRPHYC_DX0DQTR_DQDLY2     DDRPHYC_DX0DQTR_DQDLY2_Msk           /*!< DQ delay for bit 2 */
#define DDRPHYC_DX0DQTR_DQDLY2_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY2_Pos) /*!< 0x00000100 */
#define DDRPHYC_DX0DQTR_DQDLY2_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY2_Pos) /*!< 0x00000200 */
#define DDRPHYC_DX0DQTR_DQDLY2_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY2_Pos) /*!< 0x00000400 */
#define DDRPHYC_DX0DQTR_DQDLY2_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY2_Pos) /*!< 0x00000800 */
#define DDRPHYC_DX0DQTR_DQDLY3_Pos (12U)
#define DDRPHYC_DX0DQTR_DQDLY3_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY3_Pos) /*!< 0x0000F000 */
#define DDRPHYC_DX0DQTR_DQDLY3     DDRPHYC_DX0DQTR_DQDLY3_Msk           /*!< DQ delay for bit 3 */
#define DDRPHYC_DX0DQTR_DQDLY3_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY3_Pos) /*!< 0x00001000 */
#define DDRPHYC_DX0DQTR_DQDLY3_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY3_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX0DQTR_DQDLY3_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY3_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX0DQTR_DQDLY3_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY3_Pos) /*!< 0x00008000 */
#define DDRPHYC_DX0DQTR_DQDLY4_Pos (16U)
#define DDRPHYC_DX0DQTR_DQDLY4_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY4_Pos) /*!< 0x000F0000 */
#define DDRPHYC_DX0DQTR_DQDLY4     DDRPHYC_DX0DQTR_DQDLY4_Msk           /*!< DQ delay for bit 4 */
#define DDRPHYC_DX0DQTR_DQDLY4_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY4_Pos) /*!< 0x00010000 */
#define DDRPHYC_DX0DQTR_DQDLY4_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY4_Pos) /*!< 0x00020000 */
#define DDRPHYC_DX0DQTR_DQDLY4_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY4_Pos) /*!< 0x00040000 */
#define DDRPHYC_DX0DQTR_DQDLY4_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY4_Pos) /*!< 0x00080000 */
#define DDRPHYC_DX0DQTR_DQDLY5_Pos (20U)
#define DDRPHYC_DX0DQTR_DQDLY5_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY5_Pos) /*!< 0x00F00000 */
#define DDRPHYC_DX0DQTR_DQDLY5     DDRPHYC_DX0DQTR_DQDLY5_Msk           /*!< DQ delay for bit 5 */
#define DDRPHYC_DX0DQTR_DQDLY5_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY5_Pos) /*!< 0x00100000 */
#define DDRPHYC_DX0DQTR_DQDLY5_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY5_Pos) /*!< 0x00200000 */
#define DDRPHYC_DX0DQTR_DQDLY5_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY5_Pos) /*!< 0x00400000 */
#define DDRPHYC_DX0DQTR_DQDLY5_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY5_Pos) /*!< 0x00800000 */
#define DDRPHYC_DX0DQTR_DQDLY6_Pos (24U)
#define DDRPHYC_DX0DQTR_DQDLY6_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY6_Pos) /*!< 0x0F000000 */
#define DDRPHYC_DX0DQTR_DQDLY6     DDRPHYC_DX0DQTR_DQDLY6_Msk           /*!< DQ delay for bit 6 */
#define DDRPHYC_DX0DQTR_DQDLY6_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY6_Pos) /*!< 0x01000000 */
#define DDRPHYC_DX0DQTR_DQDLY6_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY6_Pos) /*!< 0x02000000 */
#define DDRPHYC_DX0DQTR_DQDLY6_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY6_Pos) /*!< 0x04000000 */
#define DDRPHYC_DX0DQTR_DQDLY6_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY6_Pos) /*!< 0x08000000 */
#define DDRPHYC_DX0DQTR_DQDLY7_Pos (28U)
#define DDRPHYC_DX0DQTR_DQDLY7_Msk (0xFUL << DDRPHYC_DX0DQTR_DQDLY7_Pos) /*!< 0xF0000000 */
#define DDRPHYC_DX0DQTR_DQDLY7     DDRPHYC_DX0DQTR_DQDLY7_Msk           /*!< DQ delay for bit 7 */
#define DDRPHYC_DX0DQTR_DQDLY7_0   (0x1UL << DDRPHYC_DX0DQTR_DQDLY7_Pos) /*!< 0x10000000 */
#define DDRPHYC_DX0DQTR_DQDLY7_1   (0x2UL << DDRPHYC_DX0DQTR_DQDLY7_Pos) /*!< 0x20000000 */
#define DDRPHYC_DX0DQTR_DQDLY7_2   (0x4UL << DDRPHYC_DX0DQTR_DQDLY7_Pos) /*!< 0x40000000 */
#define DDRPHYC_DX0DQTR_DQDLY7_3   (0x8UL << DDRPHYC_DX0DQTR_DQDLY7_Pos) /*!< 0x80000000 */

/***************  Bit definition for DDRPHYC_DX0DQSTR register  ***************/
#define DDRPHYC_DX0DQSTR_R0DGSL_Pos  (0U)
#define DDRPHYC_DX0DQSTR_R0DGSL_Msk  (0x7UL << DDRPHYC_DX0DQSTR_R0DGSL_Pos)  /*!< 0x00000007 */
#define DDRPHYC_DX0DQSTR_R0DGSL      DDRPHYC_DX0DQSTR_R0DGSL_Msk            /*!< Rank 0 DQS gating system latency */
#define DDRPHYC_DX0DQSTR_R0DGSL_0    (0x1UL << DDRPHYC_DX0DQSTR_R0DGSL_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DX0DQSTR_R0DGSL_1    (0x2UL << DDRPHYC_DX0DQSTR_R0DGSL_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DX0DQSTR_R0DGSL_2    (0x4UL << DDRPHYC_DX0DQSTR_R0DGSL_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DX0DQSTR_R0DGPS_Pos  (12U)
#define DDRPHYC_DX0DQSTR_R0DGPS_Msk  (0x3UL << DDRPHYC_DX0DQSTR_R0DGPS_Pos)  /*!< 0x00003000 */
#define DDRPHYC_DX0DQSTR_R0DGPS      DDRPHYC_DX0DQSTR_R0DGPS_Msk            /*!< Rank 0 DQS gating phase select */
#define DDRPHYC_DX0DQSTR_R0DGPS_0    (0x1UL << DDRPHYC_DX0DQSTR_R0DGPS_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX0DQSTR_R0DGPS_1    (0x2UL << DDRPHYC_DX0DQSTR_R0DGPS_Pos)  /*!< 0x00002000 */
#define DDRPHYC_DX0DQSTR_DQSDLY_Pos  (20U)
#define DDRPHYC_DX0DQSTR_DQSDLY_Msk  (0x7UL << DDRPHYC_DX0DQSTR_DQSDLY_Pos)  /*!< 0x00700000 */
#define DDRPHYC_DX0DQSTR_DQSDLY      DDRPHYC_DX0DQSTR_DQSDLY_Msk            /*!< DQS delay */
#define DDRPHYC_DX0DQSTR_DQSDLY_0    (0x1UL << DDRPHYC_DX0DQSTR_DQSDLY_Pos)  /*!< 0x00100000 */
#define DDRPHYC_DX0DQSTR_DQSDLY_1    (0x2UL << DDRPHYC_DX0DQSTR_DQSDLY_Pos)  /*!< 0x00200000 */
#define DDRPHYC_DX0DQSTR_DQSDLY_2    (0x4UL << DDRPHYC_DX0DQSTR_DQSDLY_Pos)  /*!< 0x00400000 */
#define DDRPHYC_DX0DQSTR_DQSNDLY_Pos (23U)
#define DDRPHYC_DX0DQSTR_DQSNDLY_Msk (0x7UL << DDRPHYC_DX0DQSTR_DQSNDLY_Pos) /*!< 0x03800000 */
#define DDRPHYC_DX0DQSTR_DQSNDLY     DDRPHYC_DX0DQSTR_DQSNDLY_Msk           /*!< DQS# delay */
#define DDRPHYC_DX0DQSTR_DQSNDLY_0   (0x1UL << DDRPHYC_DX0DQSTR_DQSNDLY_Pos) /*!< 0x00800000 */
#define DDRPHYC_DX0DQSTR_DQSNDLY_1   (0x2UL << DDRPHYC_DX0DQSTR_DQSNDLY_Pos) /*!< 0x01000000 */
#define DDRPHYC_DX0DQSTR_DQSNDLY_2   (0x4UL << DDRPHYC_DX0DQSTR_DQSNDLY_Pos) /*!< 0x02000000 */
#define DDRPHYC_DX0DQSTR_DMDLY_Pos   (26U)
#define DDRPHYC_DX0DQSTR_DMDLY_Msk   (0xFUL << DDRPHYC_DX0DQSTR_DMDLY_Pos)   /*!< 0x3C000000 */
#define DDRPHYC_DX0DQSTR_DMDLY       DDRPHYC_DX0DQSTR_DMDLY_Msk             /*!< DM delay */
#define DDRPHYC_DX0DQSTR_DMDLY_0     (0x1UL << DDRPHYC_DX0DQSTR_DMDLY_Pos)   /*!< 0x04000000 */
#define DDRPHYC_DX0DQSTR_DMDLY_1     (0x2UL << DDRPHYC_DX0DQSTR_DMDLY_Pos)   /*!< 0x08000000 */
#define DDRPHYC_DX0DQSTR_DMDLY_2     (0x4UL << DDRPHYC_DX0DQSTR_DMDLY_Pos)   /*!< 0x10000000 */
#define DDRPHYC_DX0DQSTR_DMDLY_3     (0x8UL << DDRPHYC_DX0DQSTR_DMDLY_Pos)   /*!< 0x20000000 */

/****************  Bit definition for DDRPHYC_DX1GCR register  ****************/
#define DDRPHYC_DX1GCR_DXEN_Pos   (0U)
#define DDRPHYC_DX1GCR_DXEN_Msk   (0x1UL << DDRPHYC_DX1GCR_DXEN_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DX1GCR_DXEN       DDRPHYC_DX1GCR_DXEN_Msk             /*!< DATA byte enable */
#define DDRPHYC_DX1GCR_DQSODT_Pos (1U)
#define DDRPHYC_DX1GCR_DQSODT_Msk (0x1UL << DDRPHYC_DX1GCR_DQSODT_Pos) /*!< 0x00000002 */
#define DDRPHYC_DX1GCR_DQSODT     DDRPHYC_DX1GCR_DQSODT_Msk           /*!< DQS ODT enable */
#define DDRPHYC_DX1GCR_DQODT_Pos  (2U)
#define DDRPHYC_DX1GCR_DQODT_Msk  (0x1UL << DDRPHYC_DX1GCR_DQODT_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DX1GCR_DQODT      DDRPHYC_DX1GCR_DQODT_Msk            /*!< DQ ODT enable */
#define DDRPHYC_DX1GCR_DXIOM_Pos  (3U)
#define DDRPHYC_DX1GCR_DXIOM_Msk  (0x1UL << DDRPHYC_DX1GCR_DXIOM_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DX1GCR_DXIOM      DDRPHYC_DX1GCR_DXIOM_Msk            /*!< Data I/O mode */
#define DDRPHYC_DX1GCR_DXPDD_Pos  (4U)
#define DDRPHYC_DX1GCR_DXPDD_Msk  (0x1UL << DDRPHYC_DX1GCR_DXPDD_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DX1GCR_DXPDD      DDRPHYC_DX1GCR_DXPDD_Msk            /*!< Data power-down driver */
#define DDRPHYC_DX1GCR_DXPDR_Pos  (5U)
#define DDRPHYC_DX1GCR_DXPDR_Msk  (0x1UL << DDRPHYC_DX1GCR_DXPDR_Pos)  /*!< 0x00000020 */
#define DDRPHYC_DX1GCR_DXPDR      DDRPHYC_DX1GCR_DXPDR_Msk            /*!< Data power-down receiver */
#define DDRPHYC_DX1GCR_DQSRPD_Pos (6U)
#define DDRPHYC_DX1GCR_DQSRPD_Msk (0x1UL << DDRPHYC_DX1GCR_DQSRPD_Pos) /*!< 0x00000040 */
#define DDRPHYC_DX1GCR_DQSRPD     DDRPHYC_DX1GCR_DQSRPD_Msk           /*!< DQSR power-down */
#define DDRPHYC_DX1GCR_DSEN_Pos   (7U)
#define DDRPHYC_DX1GCR_DSEN_Msk   (0x3UL << DDRPHYC_DX1GCR_DSEN_Pos)   /*!< 0x00000180 */
#define DDRPHYC_DX1GCR_DSEN       DDRPHYC_DX1GCR_DSEN_Msk             /*!< Write DQS enable */
#define DDRPHYC_DX1GCR_DSEN_0     (0x1UL << DDRPHYC_DX1GCR_DSEN_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DX1GCR_DSEN_1     (0x2UL << DDRPHYC_DX1GCR_DSEN_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DX1GCR_DQSRTT_Pos (9U)
#define DDRPHYC_DX1GCR_DQSRTT_Msk (0x1UL << DDRPHYC_DX1GCR_DQSRTT_Pos) /*!< 0x00000200 */
#define DDRPHYC_DX1GCR_DQSRTT     DDRPHYC_DX1GCR_DQSRTT_Msk           /*!< DQS dynamic RTT control */
#define DDRPHYC_DX1GCR_DQRTT_Pos  (10U)
#define DDRPHYC_DX1GCR_DQRTT_Msk  (0x1UL << DDRPHYC_DX1GCR_DQRTT_Pos)  /*!< 0x00000400 */
#define DDRPHYC_DX1GCR_DQRTT      DDRPHYC_DX1GCR_DQRTT_Msk            /*!< DQ dynamic RTT control */
#define DDRPHYC_DX1GCR_RTTOH_Pos  (11U)
#define DDRPHYC_DX1GCR_RTTOH_Msk  (0x3UL << DDRPHYC_DX1GCR_RTTOH_Pos)  /*!< 0x00001800 */
#define DDRPHYC_DX1GCR_RTTOH      DDRPHYC_DX1GCR_RTTOH_Msk            /*!< RTT output hold */
#define DDRPHYC_DX1GCR_RTTOH_0    (0x1UL << DDRPHYC_DX1GCR_RTTOH_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DX1GCR_RTTOH_1    (0x2UL << DDRPHYC_DX1GCR_RTTOH_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX1GCR_RTTOAL_Pos (13U)
#define DDRPHYC_DX1GCR_RTTOAL_Msk (0x1UL << DDRPHYC_DX1GCR_RTTOAL_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX1GCR_RTTOAL     DDRPHYC_DX1GCR_RTTOAL_Msk           /*!< RTT ON additive latency */
#define DDRPHYC_DX1GCR_R0RVSL_Pos (14U)
#define DDRPHYC_DX1GCR_R0RVSL_Msk (0x7UL << DDRPHYC_DX1GCR_R0RVSL_Pos) /*!< 0x0001C000 */
#define DDRPHYC_DX1GCR_R0RVSL     DDRPHYC_DX1GCR_R0RVSL_Msk           /*!< Read valid system latency in steps */
#define DDRPHYC_DX1GCR_R0RVSL_0   (0x1UL << DDRPHYC_DX1GCR_R0RVSL_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX1GCR_R0RVSL_1   (0x2UL << DDRPHYC_DX1GCR_R0RVSL_Pos) /*!< 0x00008000 */
#define DDRPHYC_DX1GCR_R0RVSL_2   (0x4UL << DDRPHYC_DX1GCR_R0RVSL_Pos) /*!< 0x00010000 */

/***************  Bit definition for DDRPHYC_DX1GSR0 register  ****************/
#define DDRPHYC_DX1GSR0_DTDONE_Pos (0U)
#define DDRPHYC_DX1GSR0_DTDONE_Msk (0x1UL << DDRPHYC_DX1GSR0_DTDONE_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX1GSR0_DTDONE     DDRPHYC_DX1GSR0_DTDONE_Msk           /*!< Data training done */
#define DDRPHYC_DX1GSR0_DTERR_Pos  (4U)
#define DDRPHYC_DX1GSR0_DTERR_Msk  (0x1UL << DDRPHYC_DX1GSR0_DTERR_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DX1GSR0_DTERR      DDRPHYC_DX1GSR0_DTERR_Msk            /*!< DQS gate training error */
#define DDRPHYC_DX1GSR0_DTIERR_Pos (8U)
#define DDRPHYC_DX1GSR0_DTIERR_Msk (0x1UL << DDRPHYC_DX1GSR0_DTIERR_Pos) /*!< 0x00000100 */
#define DDRPHYC_DX1GSR0_DTIERR     DDRPHYC_DX1GSR0_DTIERR_Msk           /*!< DQS gate training intermittent error */
#define DDRPHYC_DX1GSR0_DTPASS_Pos (13U)
#define DDRPHYC_DX1GSR0_DTPASS_Msk (0x7UL << DDRPHYC_DX1GSR0_DTPASS_Pos) /*!< 0x0000E000 */
#define DDRPHYC_DX1GSR0_DTPASS     DDRPHYC_DX1GSR0_DTPASS_Msk           /*!< DQS training pass count */
#define DDRPHYC_DX1GSR0_DTPASS_0   (0x1UL << DDRPHYC_DX1GSR0_DTPASS_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX1GSR0_DTPASS_1   (0x2UL << DDRPHYC_DX1GSR0_DTPASS_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX1GSR0_DTPASS_2   (0x4UL << DDRPHYC_DX1GSR0_DTPASS_Pos) /*!< 0x00008000 */

/***************  Bit definition for DDRPHYC_DX1GSR1 register  ****************/
#define DDRPHYC_DX1GSR1_DFTERR_Pos (0U)
#define DDRPHYC_DX1GSR1_DFTERR_Msk (0x1UL << DDRPHYC_DX1GSR1_DFTERR_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX1GSR1_DFTERR     DDRPHYC_DX1GSR1_DFTERR_Msk           /*!< DQS drift error */
#define DDRPHYC_DX1GSR1_DQSDFT_Pos (4U)
#define DDRPHYC_DX1GSR1_DQSDFT_Msk (0x3UL << DDRPHYC_DX1GSR1_DQSDFT_Pos) /*!< 0x00000030 */
#define DDRPHYC_DX1GSR1_DQSDFT     DDRPHYC_DX1GSR1_DQSDFT_Msk           /*!< DQS drift value */
#define DDRPHYC_DX1GSR1_DQSDFT_0   (0x1UL << DDRPHYC_DX1GSR1_DQSDFT_Pos) /*!< 0x00000010 */
#define DDRPHYC_DX1GSR1_DQSDFT_1   (0x2UL << DDRPHYC_DX1GSR1_DQSDFT_Pos) /*!< 0x00000020 */
#define DDRPHYC_DX1GSR1_RVERR_Pos  (12U)
#define DDRPHYC_DX1GSR1_RVERR_Msk  (0x1UL << DDRPHYC_DX1GSR1_RVERR_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX1GSR1_RVERR      DDRPHYC_DX1GSR1_RVERR_Msk            /*!< RV training error */
#define DDRPHYC_DX1GSR1_RVIERR_Pos (16U)
#define DDRPHYC_DX1GSR1_RVIERR_Msk (0x1UL << DDRPHYC_DX1GSR1_RVIERR_Pos) /*!< 0x00010000 */
#define DDRPHYC_DX1GSR1_RVIERR     DDRPHYC_DX1GSR1_RVIERR_Msk           /*!< RV intermittent error for rank */
#define DDRPHYC_DX1GSR1_RVPASS_Pos (20U)
#define DDRPHYC_DX1GSR1_RVPASS_Msk (0x7UL << DDRPHYC_DX1GSR1_RVPASS_Pos) /*!< 0x00700000 */
#define DDRPHYC_DX1GSR1_RVPASS     DDRPHYC_DX1GSR1_RVPASS_Msk           /*!< Read valid training pass count */
#define DDRPHYC_DX1GSR1_RVPASS_0   (0x1UL << DDRPHYC_DX1GSR1_RVPASS_Pos) /*!< 0x00100000 */
#define DDRPHYC_DX1GSR1_RVPASS_1   (0x2UL << DDRPHYC_DX1GSR1_RVPASS_Pos) /*!< 0x00200000 */
#define DDRPHYC_DX1GSR1_RVPASS_2   (0x4UL << DDRPHYC_DX1GSR1_RVPASS_Pos) /*!< 0x00400000 */

