zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/***************  Bit definition for RCC_MP_RSTSSETR register  ****************/
#define RCC_MP_RSTSSETR_PORRSTF_Pos                (0U)
#define RCC_MP_RSTSSETR_PORRSTF_Msk                (0x1UL << RCC_MP_RSTSSETR_PORRSTF_Pos)               /*!< 0x00000001 */
#define RCC_MP_RSTSSETR_PORRSTF                    RCC_MP_RSTSSETR_PORRSTF_Msk                         /*!< POR/PDR reset flag Set by the BOOTROM code when a POR/PDR reset occurred. */
#define RCC_MP_RSTSSETR_BORRSTF_Pos                (1U)
#define RCC_MP_RSTSSETR_BORRSTF_Msk                (0x1UL << RCC_MP_RSTSSETR_BORRSTF_Pos)               /*!< 0x00000002 */
#define RCC_MP_RSTSSETR_BORRSTF                    RCC_MP_RSTSSETR_BORRSTF_Msk                         /*!< BOR reset flag Set by the BOOTROM code when a BOR reset occurred. */
#define RCC_MP_RSTSSETR_PADRSTF_Pos                (2U)
#define RCC_MP_RSTSSETR_PADRSTF_Msk                (0x1UL << RCC_MP_RSTSSETR_PADRSTF_Pos)               /*!< 0x00000004 */
#define RCC_MP_RSTSSETR_PADRSTF                    RCC_MP_RSTSSETR_PADRSTF_Msk                         /*!< NRST reset flag Set by the BOOTROM code when a PAD reset occurred. */
#define RCC_MP_RSTSSETR_HCSSRSTF_Pos               (3U)
#define RCC_MP_RSTSSETR_HCSSRSTF_Msk               (0x1UL << RCC_MP_RSTSSETR_HCSSRSTF_Pos)              /*!< 0x00000008 */
#define RCC_MP_RSTSSETR_HCSSRSTF                   RCC_MP_RSTSSETR_HCSSRSTF_Msk                        /*!< HSE CSS reset flag Set by the BOOTROM code when a failure is detected on HSE. */
#define RCC_MP_RSTSSETR_VCORERSTF_Pos              (4U)
#define RCC_MP_RSTSSETR_VCORERSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_VCORERSTF_Pos)             /*!< 0x00000010 */
#define RCC_MP_RSTSSETR_VCORERSTF                  RCC_MP_RSTSSETR_VCORERSTF_Msk                       /*!< VDDCORE reset flag Set by the BOOTROM code when a reset occurred because VDDCORE is lower than the expected value. */
#define RCC_MP_RSTSSETR_VCPURSTF_Pos               (5U)
#define RCC_MP_RSTSSETR_VCPURSTF_Msk               (0x1UL << RCC_MP_RSTSSETR_VCPURSTF_Pos)              /*!< 0x00000020 */
#define RCC_MP_RSTSSETR_VCPURSTF                   RCC_MP_RSTSSETR_VCPURSTF_Msk                        /*!< VCPU reset flag Set by the BOOTROM code when a reset occurred because VCPU is lower than the expected value. */
#define RCC_MP_RSTSSETR_MPSYSRSTF_Pos              (6U)
#define RCC_MP_RSTSSETR_MPSYSRSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_MPSYSRSTF_Pos)             /*!< 0x00000040 */
#define RCC_MP_RSTSSETR_MPSYSRSTF                  RCC_MP_RSTSSETR_MPSYSRSTF_Msk                       /*!< MPU System reset flag Set by the BOOTROM code when a MPU system reset occurred. */
#define RCC_MP_RSTSSETR_IWDG1RSTF_Pos              (8U)
#define RCC_MP_RSTSSETR_IWDG1RSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_IWDG1RSTF_Pos)             /*!< 0x00000100 */
#define RCC_MP_RSTSSETR_IWDG1RSTF                  RCC_MP_RSTSSETR_IWDG1RSTF_Msk                       /*!< IWDG1 reset flag Set by the BOOTROM code when a IWDG1 reset occurred. */
#define RCC_MP_RSTSSETR_IWDG2RSTF_Pos              (9U)
#define RCC_MP_RSTSSETR_IWDG2RSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_IWDG2RSTF_Pos)             /*!< 0x00000200 */
#define RCC_MP_RSTSSETR_IWDG2RSTF                  RCC_MP_RSTSSETR_IWDG2RSTF_Msk                       /*!< IWDG2 reset flag Set by the BOOTROM code when a IWDG2 reset occurred. */
#define RCC_MP_RSTSSETR_STP2RSTF_Pos               (10U)
#define RCC_MP_RSTSSETR_STP2RSTF_Msk               (0x1UL << RCC_MP_RSTSSETR_STP2RSTF_Pos)              /*!< 0x00000400 */
#define RCC_MP_RSTSSETR_STP2RSTF                   RCC_MP_RSTSSETR_STP2RSTF_Msk                        /*!< Stop2 reset flag Set by the BOOTROM code when exiting from Stop2. */
#define RCC_MP_RSTSSETR_STDBYRSTF_Pos              (11U)
#define RCC_MP_RSTSSETR_STDBYRSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_STDBYRSTF_Pos)             /*!< 0x00000800 */
#define RCC_MP_RSTSSETR_STDBYRSTF                  RCC_MP_RSTSSETR_STDBYRSTF_Msk                       /*!< System Standby reset flag Set by the BOOTROM code when exiting from Standby. */
#define RCC_MP_RSTSSETR_CSTDBYRSTF_Pos             (12U)
#define RCC_MP_RSTSSETR_CSTDBYRSTF_Msk             (0x1UL << RCC_MP_RSTSSETR_CSTDBYRSTF_Pos)            /*!< 0x00001000 */
#define RCC_MP_RSTSSETR_CSTDBYRSTF                 RCC_MP_RSTSSETR_CSTDBYRSTF_Msk                      /*!< MPU CStandby reset flag Set by the BOOTROM code when the MPU exits from CStandby. */
#define RCC_MP_RSTSSETR_MPUP0RSTF_Pos              (13U)
#define RCC_MP_RSTSSETR_MPUP0RSTF_Msk              (0x1UL << RCC_MP_RSTSSETR_MPUP0RSTF_Pos)             /*!< 0x00002000 */
#define RCC_MP_RSTSSETR_MPUP0RSTF                  RCC_MP_RSTSSETR_MPUP0RSTF_Msk                       /*!< MPU processor reset flag Set by the BOOTROM code when a MPU processor reset occurred. */
#define RCC_MP_RSTSSETR_SPARE_Pos                  (15U)
#define RCC_MP_RSTSSETR_SPARE_Msk                  (0x1UL << RCC_MP_RSTSSETR_SPARE_Pos)                 /*!< 0x00008000 */
#define RCC_MP_RSTSSETR_SPARE                      RCC_MP_RSTSSETR_SPARE_Msk                           /*!< Spare bit Set and reset by software. Reserved for future use. */

/***************  Bit definition for RCC_MP_RSTSCLRR register  ****************/
#define RCC_MP_RSTSCLRR_PORRSTF_Pos                (0U)
#define RCC_MP_RSTSCLRR_PORRSTF_Msk                (0x1UL << RCC_MP_RSTSCLRR_PORRSTF_Pos)               /*!< 0x00000001 */
#define RCC_MP_RSTSCLRR_PORRSTF                    RCC_MP_RSTSCLRR_PORRSTF_Msk                         /*!< POR/PDR reset flag Cleared by software, set by the BOOTROM code when a POR/PDR reset occurred. */
#define RCC_MP_RSTSCLRR_BORRSTF_Pos                (1U)
#define RCC_MP_RSTSCLRR_BORRSTF_Msk                (0x1UL << RCC_MP_RSTSCLRR_BORRSTF_Pos)               /*!< 0x00000002 */
#define RCC_MP_RSTSCLRR_BORRSTF                    RCC_MP_RSTSCLRR_BORRSTF_Msk                         /*!< BOR reset flag Cleared by software, set by the BOOTROM code when a BOR reset occurred. */
#define RCC_MP_RSTSCLRR_PADRSTF_Pos                (2U)
#define RCC_MP_RSTSCLRR_PADRSTF_Msk                (0x1UL << RCC_MP_RSTSCLRR_PADRSTF_Pos)               /*!< 0x00000004 */
#define RCC_MP_RSTSCLRR_PADRSTF                    RCC_MP_RSTSCLRR_PADRSTF_Msk                         /*!< NRST reset flag Cleared by software, set by the BOOTROM code when a PAD reset occurred. */
#define RCC_MP_RSTSCLRR_HCSSRSTF_Pos               (3U)
#define RCC_MP_RSTSCLRR_HCSSRSTF_Msk               (0x1UL << RCC_MP_RSTSCLRR_HCSSRSTF_Pos)              /*!< 0x00000008 */
#define RCC_MP_RSTSCLRR_HCSSRSTF                   RCC_MP_RSTSCLRR_HCSSRSTF_Msk                        /*!< HSE CSS reset flag Cleared by software, set by the BOOTROM code when a failure is detected on HSE. */
#define RCC_MP_RSTSCLRR_VCORERSTF_Pos              (4U)
#define RCC_MP_RSTSCLRR_VCORERSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_VCORERSTF_Pos)             /*!< 0x00000010 */
#define RCC_MP_RSTSCLRR_VCORERSTF                  RCC_MP_RSTSCLRR_VCORERSTF_Msk                       /*!< VDDCORE reset flag Cleared by software, set by the BOOTROM code when a reset occurred because VDDCORE is lower than the expected value. */
#define RCC_MP_RSTSCLRR_VCPURSTF_Pos               (5U)
#define RCC_MP_RSTSCLRR_VCPURSTF_Msk               (0x1UL << RCC_MP_RSTSCLRR_VCPURSTF_Pos)              /*!< 0x00000020 */
#define RCC_MP_RSTSCLRR_VCPURSTF                   RCC_MP_RSTSCLRR_VCPURSTF_Msk                        /*!< VDDCPU reset flag Cleared by software, set by the BOOTROM code when a reset occurred because VDDCPU is lower than the expected value. */
#define RCC_MP_RSTSCLRR_MPSYSRSTF_Pos              (6U)
#define RCC_MP_RSTSCLRR_MPSYSRSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_MPSYSRSTF_Pos)             /*!< 0x00000040 */
#define RCC_MP_RSTSCLRR_MPSYSRSTF                  RCC_MP_RSTSCLRR_MPSYSRSTF_Msk                       /*!< MPU System reset flag Cleared by software, set by the BOOTROM code when a MPU system reset occurred. */
#define RCC_MP_RSTSCLRR_IWDG1RSTF_Pos              (8U)
#define RCC_MP_RSTSCLRR_IWDG1RSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_IWDG1RSTF_Pos)             /*!< 0x00000100 */
#define RCC_MP_RSTSCLRR_IWDG1RSTF                  RCC_MP_RSTSCLRR_IWDG1RSTF_Msk                       /*!< IWDG1 reset flag Cleared by software, set by the BOOTROM code when a IWDG1 reset occurred. */
#define RCC_MP_RSTSCLRR_IWDG2RSTF_Pos              (9U)
#define RCC_MP_RSTSCLRR_IWDG2RSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_IWDG2RSTF_Pos)             /*!< 0x00000200 */
#define RCC_MP_RSTSCLRR_IWDG2RSTF                  RCC_MP_RSTSCLRR_IWDG2RSTF_Msk                       /*!< IWDG2 reset flag Cleared by software, set by the BOOTROM code when a IWDG2 reset occurred. */
#define RCC_MP_RSTSCLRR_STP2RSTF_Pos               (10U)
#define RCC_MP_RSTSCLRR_STP2RSTF_Msk               (0x1UL << RCC_MP_RSTSCLRR_STP2RSTF_Pos)              /*!< 0x00000400 */
#define RCC_MP_RSTSCLRR_STP2RSTF                   RCC_MP_RSTSCLRR_STP2RSTF_Msk                        /*!< Stop2 reset flag Cleared by software, set by the BOOTROM code when exiting from Stop2. */
#define RCC_MP_RSTSCLRR_STDBYRSTF_Pos              (11U)
#define RCC_MP_RSTSCLRR_STDBYRSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_STDBYRSTF_Pos)             /*!< 0x00000800 */
#define RCC_MP_RSTSCLRR_STDBYRSTF                  RCC_MP_RSTSCLRR_STDBYRSTF_Msk                       /*!< System Standby reset flag Cleared by software, set by the BOOTROM code when exiting from Standby. */
#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos             (12U)
#define RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk             (0x1UL << RCC_MP_RSTSCLRR_CSTDBYRSTF_Pos)            /*!< 0x00001000 */
#define RCC_MP_RSTSCLRR_CSTDBYRSTF                 RCC_MP_RSTSCLRR_CSTDBYRSTF_Msk                      /*!< MPU CStandby reset flag Cleared by software, set by the BOOTROM code when the MPU exits from CStandby. */
#define RCC_MP_RSTSCLRR_MPUP0RSTF_Pos              (13U)
#define RCC_MP_RSTSCLRR_MPUP0RSTF_Msk              (0x1UL << RCC_MP_RSTSCLRR_MPUP0RSTF_Pos)             /*!< 0x00002000 */
#define RCC_MP_RSTSCLRR_MPUP0RSTF                  RCC_MP_RSTSCLRR_MPUP0RSTF_Msk                       /*!< MPU processor reset flag Cleared by software, set by the BOOTROM code when a MPU processor reset occurred. */
#define RCC_MP_RSTSCLRR_SPARE_Pos                  (15U)
#define RCC_MP_RSTSCLRR_SPARE_Msk                  (0x1UL << RCC_MP_RSTSCLRR_SPARE_Pos)                 /*!< 0x00008000 */
#define RCC_MP_RSTSCLRR_SPARE                      RCC_MP_RSTSCLRR_SPARE_Msk                           /*!< Spare bit Set and reset by software. Reserved for future use. */

/**************  Bit definition for RCC_MP_IWDGFZSETR register  ***************/
#define RCC_MP_IWDGFZSETR_FZ_IWDG1_Pos             (0U)
#define RCC_MP_IWDGFZSETR_FZ_IWDG1_Msk             (0x1UL << RCC_MP_IWDGFZSETR_FZ_IWDG1_Pos)            /*!< 0x00000001 */
#define RCC_MP_IWDGFZSETR_FZ_IWDG1                 RCC_MP_IWDGFZSETR_FZ_IWDG1_Msk                      /*!< Freeze the IWDG1 clock If IWDG1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set once by the BOOTROM software after a system reset or Standby reset, or a CStandby reset, in order to freeze the IWDG1. */
#define RCC_MP_IWDGFZSETR_FZ_IWDG2_Pos             (1U)
#define RCC_MP_IWDGFZSETR_FZ_IWDG2_Msk             (0x1UL << RCC_MP_IWDGFZSETR_FZ_IWDG2_Pos)            /*!< 0x00000002 */
#define RCC_MP_IWDGFZSETR_FZ_IWDG2                 RCC_MP_IWDGFZSETR_FZ_IWDG2_Msk                      /*!< Freeze the IWDG2 clock Set once by the BOOTROM software after a system reset or Standby reset, or a CStandby reset, in order to freeze the IWDG2. */

/**************  Bit definition for RCC_MP_IWDGFZCLRR register  ***************/
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1_Pos             (0U)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1_Msk             (0x1UL << RCC_MP_IWDGFZCLRR_FZ_IWDG1_Pos)            /*!< 0x00000001 */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG1                 RCC_MP_IWDGFZCLRR_FZ_IWDG1_Msk                      /*!< Unfreeze the IWDG1 clock If IWDG1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by the BOOTROM software, in order to unfreeze the IWDG1. */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2_Pos             (1U)
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2_Msk             (0x1UL << RCC_MP_IWDGFZCLRR_FZ_IWDG2_Pos)            /*!< 0x00000002 */
#define RCC_MP_IWDGFZCLRR_FZ_IWDG2                 RCC_MP_IWDGFZCLRR_FZ_IWDG2_Msk                      /*!< Unfreeze the IWDG2 clock Cleared by the BOOTROM software, in order to unfreeze the IWDG2. */

/*****************  Bit definition for RCC_MP_CIER register  ******************/
#define RCC_MP_CIER_LSIRDYIE_Pos                   (0U)
#define RCC_MP_CIER_LSIRDYIE_Msk                   (0x1UL << RCC_MP_CIER_LSIRDYIE_Pos)                  /*!< 0x00000001 */
#define RCC_MP_CIER_LSIRDYIE                       RCC_MP_CIER_LSIRDYIE_Msk                            /*!< LSI ready Interrupt Enable If RCC_SECCFGR.LSISEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the LSI oscillator stabilization. */
#define RCC_MP_CIER_LSERDYIE_Pos                   (1U)
#define RCC_MP_CIER_LSERDYIE_Msk                   (0x1UL << RCC_MP_CIER_LSERDYIE_Pos)                  /*!< 0x00000002 */
#define RCC_MP_CIER_LSERDYIE                       RCC_MP_CIER_LSERDYIE_Msk                            /*!< LSE ready Interrupt Enable If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the LSE oscillator stabilization. */
#define RCC_MP_CIER_HSIRDYIE_Pos                   (2U)
#define RCC_MP_CIER_HSIRDYIE_Msk                   (0x1UL << RCC_MP_CIER_HSIRDYIE_Pos)                  /*!< 0x00000004 */
#define RCC_MP_CIER_HSIRDYIE                       RCC_MP_CIER_HSIRDYIE_Msk                            /*!< HSI ready Interrupt Enable If RCC_SECCFGR.HSISEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the HSI oscillator stabilization. */
#define RCC_MP_CIER_HSERDYIE_Pos                   (3U)
#define RCC_MP_CIER_HSERDYIE_Msk                   (0x1UL << RCC_MP_CIER_HSERDYIE_Pos)                  /*!< 0x00000008 */
#define RCC_MP_CIER_HSERDYIE                       RCC_MP_CIER_HSERDYIE_Msk                            /*!< HSE ready Interrupt Enable If RCC_SECCFGR.HSESEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the HSE oscillator stabilization. */
#define RCC_MP_CIER_CSIRDYIE_Pos                   (4U)
#define RCC_MP_CIER_CSIRDYIE_Msk                   (0x1UL << RCC_MP_CIER_CSIRDYIE_Pos)                  /*!< 0x00000010 */
#define RCC_MP_CIER_CSIRDYIE                       RCC_MP_CIER_CSIRDYIE_Msk                            /*!< CSI ready Interrupt Enable If RCC_SECCFGR.CSISEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the CSI oscillator stabilization. */
#define RCC_MP_CIER_PLL1DYIE_Pos                   (8U)
#define RCC_MP_CIER_PLL1DYIE_Msk                   (0x1UL << RCC_MP_CIER_PLL1DYIE_Pos)                  /*!< 0x00000100 */
#define RCC_MP_CIER_PLL1DYIE                       RCC_MP_CIER_PLL1DYIE_Msk                            /*!< PLL1 ready Interrupt Enable If RCC_SECCFGR.PLL12SEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by PLL1 lock. */
#define RCC_MP_CIER_PLL2DYIE_Pos                   (9U)
#define RCC_MP_CIER_PLL2DYIE_Msk                   (0x1UL << RCC_MP_CIER_PLL2DYIE_Pos)                  /*!< 0x00000200 */
#define RCC_MP_CIER_PLL2DYIE                       RCC_MP_CIER_PLL2DYIE_Msk                            /*!< PLL2 ready Interrupt Enable If RCC_SECCFGR.PLL12SEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by PLL2 lock. */
#define RCC_MP_CIER_PLL3DYIE_Pos                   (10U)
#define RCC_MP_CIER_PLL3DYIE_Msk                   (0x1UL << RCC_MP_CIER_PLL3DYIE_Pos)                  /*!< 0x00000400 */
#define RCC_MP_CIER_PLL3DYIE                       RCC_MP_CIER_PLL3DYIE_Msk                            /*!< PLL3 ready Interrupt Enable If RCC_SECCFGR.PLL3SEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by PLL3 lock. */
#define RCC_MP_CIER_PLL4DYIE_Pos                   (11U)
#define RCC_MP_CIER_PLL4DYIE_Msk                   (0x1UL << RCC_MP_CIER_PLL4DYIE_Pos)                  /*!< 0x00000800 */
#define RCC_MP_CIER_PLL4DYIE                       RCC_MP_CIER_PLL4DYIE_Msk                            /*!< PLL4 ready Interrupt Enable If RCC_SECCFGR.PLL4SEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by PLL4 lock. */
#define RCC_MP_CIER_LSECSSIE_Pos                   (16U)
#define RCC_MP_CIER_LSECSSIE_Msk                   (0x1UL << RCC_MP_CIER_LSECSSIE_Pos)                  /*!< 0x00010000 */
#define RCC_MP_CIER_LSECSSIE                       RCC_MP_CIER_LSECSSIE_Msk                            /*!< LSE clock security system Interrupt Enable If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable interrupt caused by the Clock Security System on external 32 kHz oscillator. */
#define RCC_MP_CIER_WKUPIE_Pos                     (20U)
#define RCC_MP_CIER_WKUPIE_Msk                     (0x1UL << RCC_MP_CIER_WKUPIE_Pos)                    /*!< 0x00100000 */
#define RCC_MP_CIER_WKUPIE                         RCC_MP_CIER_WKUPIE_Msk                              /*!< Wake up from CStop Interrupt Enable If RCC_SECCFGR.STPSEC, a write access to this field must be secure. A read access may be secure or non-secure. Set and reset by software to enable/disable the generation of the interrupt used to wake up the MPU from CStop. */

