zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/*****************  Bit definition for RCC_MP_CIFR register  ******************/
#define RCC_MP_CIFR_LSIRDYF_Pos                    (0U)
#define RCC_MP_CIFR_LSIRDYF_Msk                    (0x1UL << RCC_MP_CIFR_LSIRDYF_Pos)                   /*!< 0x00000001 */
#define RCC_MP_CIFR_LSIRDYF                        RCC_MP_CIFR_LSIRDYF_Msk                             /*!< LSI ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the LSI clock becomes stable. */
#define RCC_MP_CIFR_LSERDYF_Pos                    (1U)
#define RCC_MP_CIFR_LSERDYF_Msk                    (0x1UL << RCC_MP_CIFR_LSERDYF_Pos)                   /*!< 0x00000002 */
#define RCC_MP_CIFR_LSERDYF                        RCC_MP_CIFR_LSERDYF_Msk                             /*!< LSE ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the LSE clock becomes stable. */
#define RCC_MP_CIFR_HSIRDYF_Pos                    (2U)
#define RCC_MP_CIFR_HSIRDYF_Msk                    (0x1UL << RCC_MP_CIFR_HSIRDYF_Pos)                   /*!< 0x00000004 */
#define RCC_MP_CIFR_HSIRDYF                        RCC_MP_CIFR_HSIRDYF_Msk                             /*!< HSI ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the HSI clock becomes stable. */
#define RCC_MP_CIFR_HSERDYF_Pos                    (3U)
#define RCC_MP_CIFR_HSERDYF_Msk                    (0x1UL << RCC_MP_CIFR_HSERDYF_Pos)                   /*!< 0x00000008 */
#define RCC_MP_CIFR_HSERDYF                        RCC_MP_CIFR_HSERDYF_Msk                             /*!< HSE ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the HSE clock becomes stable. */
#define RCC_MP_CIFR_CSIRDYF_Pos                    (4U)
#define RCC_MP_CIFR_CSIRDYF_Msk                    (0x1UL << RCC_MP_CIFR_CSIRDYF_Pos)                   /*!< 0x00000010 */
#define RCC_MP_CIFR_CSIRDYF                        RCC_MP_CIFR_CSIRDYF_Msk                             /*!< CSI ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the CSI clock becomes stable. */
#define RCC_MP_CIFR_PLL1DYF_Pos                    (8U)
#define RCC_MP_CIFR_PLL1DYF_Msk                    (0x1UL << RCC_MP_CIFR_PLL1DYF_Pos)                   /*!< 0x00000100 */
#define RCC_MP_CIFR_PLL1DYF                        RCC_MP_CIFR_PLL1DYF_Msk                             /*!< PLL1 ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the PLL1 locks. */
#define RCC_MP_CIFR_PLL2DYF_Pos                    (9U)
#define RCC_MP_CIFR_PLL2DYF_Msk                    (0x1UL << RCC_MP_CIFR_PLL2DYF_Pos)                   /*!< 0x00000200 */
#define RCC_MP_CIFR_PLL2DYF                        RCC_MP_CIFR_PLL2DYF_Msk                             /*!< PLL2 ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the PLL2 locks. */
#define RCC_MP_CIFR_PLL3DYF_Pos                    (10U)
#define RCC_MP_CIFR_PLL3DYF_Msk                    (0x1UL << RCC_MP_CIFR_PLL3DYF_Pos)                   /*!< 0x00000400 */
#define RCC_MP_CIFR_PLL3DYF                        RCC_MP_CIFR_PLL3DYF_Msk                             /*!< PLL3 ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the PLL3 locks. */
#define RCC_MP_CIFR_PLL4DYF_Pos                    (11U)
#define RCC_MP_CIFR_PLL4DYF_Msk                    (0x1UL << RCC_MP_CIFR_PLL4DYF_Pos)                   /*!< 0x00000800 */
#define RCC_MP_CIFR_PLL4DYF                        RCC_MP_CIFR_PLL4DYF_Msk                             /*!< PLL4 ready Interrupt Flag If RCC_SECCFGR.PLLSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the PLL4 locks. */
#define RCC_MP_CIFR_LSECSSF_Pos                    (16U)
#define RCC_MP_CIFR_LSECSSF_Msk                    (0x1UL << RCC_MP_CIFR_LSECSSF_Pos)                   /*!< 0x00010000 */
#define RCC_MP_CIFR_LSECSSF                        RCC_MP_CIFR_LSECSSF_Msk                             /*!< LSE clock security system Interrupt Flag If RCC_SECCFGR.LSESEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when a failure is detected on the external 32 kHz oscillator. */
#define RCC_MP_CIFR_WKUPF_Pos                      (20U)
#define RCC_MP_CIFR_WKUPF_Msk                      (0x1UL << RCC_MP_CIFR_WKUPF_Pos)                     /*!< 0x00100000 */
#define RCC_MP_CIFR_WKUPF                          RCC_MP_CIFR_WKUPF_Msk                               /*!< Wake up from CStop Interrupt Flag If RCC_SECCFGR.STPSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reset by software by writing this flag to '1'. Set by hardware when the MPU needs to exit from CStop. */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define RCC_BDCR_LSEON_Pos                         (0U)
#define RCC_BDCR_LSEON_Msk                         (0x1UL << RCC_BDCR_LSEON_Pos)                        /*!< 0x00000001 */
#define RCC_BDCR_LSEON                             RCC_BDCR_LSEON_Msk                                  /*!< LSE oscillator enabled Set and reset by software. If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_BDCR_LSEBYP_Pos                        (1U)
#define RCC_BDCR_LSEBYP_Msk                        (0x1UL << RCC_BDCR_LSEBYP_Pos)                       /*!< 0x00000002 */
#define RCC_BDCR_LSEBYP                            RCC_BDCR_LSEBYP_Msk                                 /*!< LSE oscillator bypass Set and reset by software to bypass oscillator in debug mode. If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure. This bit must not be written when the LSE is enabled (LSEON = '1'). Refer to Stop. for details. */
#define RCC_BDCR_LSERDY_Pos                        (2U)
#define RCC_BDCR_LSERDY_Msk                        (0x1UL << RCC_BDCR_LSERDY_Pos)                       /*!< 0x00000004 */
#define RCC_BDCR_LSERDY                            RCC_BDCR_LSERDY_Msk                                 /*!< LSE oscillator ready Set and reset by hardware to indicate when the LSE is stable. This bit needs 6 cycles of lse_ck clock to fall down after LSEON has been set to '0'. */
#define RCC_BDCR_DIGBYP_Pos                        (3U)
#define RCC_BDCR_DIGBYP_Msk                        (0x1UL << RCC_BDCR_DIGBYP_Pos)                       /*!< 0x00000008 */
#define RCC_BDCR_DIGBYP                            RCC_BDCR_DIGBYP_Msk                                 /*!< LSE digital bypass Set and reset by software to select the analog or digital bypass mode. If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_BDCR_LSEDRV_Pos                        (4U)
#define RCC_BDCR_LSEDRV_Msk                        (0x3UL << RCC_BDCR_LSEDRV_Pos)                       /*!< 0x00000030 */
#define RCC_BDCR_LSEDRV                            RCC_BDCR_LSEDRV_Msk                                 /*!< LSE oscillator driving capability Written by software to select the driving capability of the LSE oscillator. If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_BDCR_LSEDRV_0                          (0x1UL << RCC_BDCR_LSEDRV_Pos)                      /*!< 0x00000010 */
#define RCC_BDCR_LSEDRV_1                          (0x2UL << RCC_BDCR_LSEDRV_Pos)                      /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON_Pos                      (8U)
#define RCC_BDCR_LSECSSON_Msk                      (0x1UL << RCC_BDCR_LSECSSON_Pos)                     /*!< 0x00000100 */
#define RCC_BDCR_LSECSSON                          RCC_BDCR_LSECSSON_Msk                               /*!< LSE clock security system enable Set by software to enable the Clock Security System on 32 kHz oscillator. If RCC_SECCFGR.LSESEC, a write access to this register field must be secure. A read access may be secure or non-secure. Refer to for details on the activation and deactivation sequences. Once the LSECSSON bit is enabled it cannot be disabled, except after a LSE failure detection (LSECSSD = '1'). */
#define RCC_BDCR_LSECSSD_Pos                       (9U)
#define RCC_BDCR_LSECSSD_Msk                       (0x1UL << RCC_BDCR_LSECSSD_Pos)                      /*!< 0x00000200 */
#define RCC_BDCR_LSECSSD                           RCC_BDCR_LSECSSD_Msk                                /*!< LSE clock security system failure detection Set by hardware to indicate when a failure has been detected by the Clock Security System on the external 32 kHz oscillator. */
#define RCC_BDCR_RTCSRC_Pos                        (16U)
#define RCC_BDCR_RTCSRC_Msk                        (0x3UL << RCC_BDCR_RTCSRC_Pos)                       /*!< 0x00030000 */
#define RCC_BDCR_RTCSRC                            RCC_BDCR_RTCSRC_Msk                                 /*!< RTC clock source selection Set by software to select the clock source for the RTC. If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. This field can be written only one time after backup domain reset. When a LSE failure occurs, the RTCSRC[1:0] is set to '00', and the software is allowed to write it again once. This field must be written before LSECSSON is enabled. Refer to for details. */
#define RCC_BDCR_RTCSRC_0                          (0x1UL << RCC_BDCR_RTCSRC_Pos)                   /*!< 0x00010000 */
#define RCC_BDCR_RTCSRC_1                          (0x2UL << RCC_BDCR_RTCSRC_Pos)                   /*!< 0x00020000 */
#define RCC_BDCR_RTCCKEN_Pos                       (20U)
#define RCC_BDCR_RTCCKEN_Msk                       (0x1UL << RCC_BDCR_RTCCKEN_Pos)                      /*!< 0x00100000 */
#define RCC_BDCR_RTCCKEN                           RCC_BDCR_RTCCKEN_Msk                                /*!< RTC clock enable Set and reset by software. If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. */
#define RCC_BDCR_VSWRST_Pos                        (31U)
#define RCC_BDCR_VSWRST_Msk                        (0x1UL << RCC_BDCR_VSWRST_Pos)                       /*!< 0x80000000 */
#define RCC_BDCR_VSWRST                            RCC_BDCR_VSWRST_Msk                                 /*!< VSW domain software reset Set and reset by software. If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure. */

/*****************  Bit definition for RCC_RDLSICR register  ******************/
#define RCC_RDLSICR_LSION_Pos                      (0U)
#define RCC_RDLSICR_LSION_Msk                      (0x1UL << RCC_RDLSICR_LSION_Pos)                     /*!< 0x00000001 */
#define RCC_RDLSICR_LSION                          RCC_RDLSICR_LSION_Msk                               /*!< LSI oscillator enabled Set and reset by software. If RCC_SECCFGR.LSISEC, a write access to this field must be secure. A read access may be secure or non-secure. This bit is used to request the activation of the LSI oscillator. Note that IWDG1 and IWDG2 can also request the activation of LSI. */
#define RCC_RDLSICR_LSIRDY_Pos                     (1U)
#define RCC_RDLSICR_LSIRDY_Msk                     (0x1UL << RCC_RDLSICR_LSIRDY_Pos)                    /*!< 0x00000002 */
#define RCC_RDLSICR_LSIRDY                         RCC_RDLSICR_LSIRDY_Msk                              /*!< LSI oscillator ready Set and reset by hardware to indicate when the LSI is stable. This bit needs 3 cycles of lsi_ck clock to fall down after LSION has been set to '0'. */
#define RCC_RDLSICR_MRD_Pos                        (16U)
#define RCC_RDLSICR_MRD_Msk                        (0x1FUL << RCC_RDLSICR_MRD_Pos)                      /*!< 0x001F0000 */
#define RCC_RDLSICR_MRD                            RCC_RDLSICR_MRD_Msk                                 /*!< Minimum reset duration Written by software. If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure. This field defines the minimum guaranteed duration of the NRST low pulse. The LSI oscillator is automatically enabled when needed by the RPCTL. ... */
#define RCC_RDLSICR_MRD_0                          (0x1UL << RCC_RDLSICR_MRD_Pos)                   /*!< 0x00010000 */
#define RCC_RDLSICR_MRD_1                          (0x2UL << RCC_RDLSICR_MRD_Pos)                   /*!< 0x00020000 */
#define RCC_RDLSICR_MRD_2                          (0x4UL << RCC_RDLSICR_MRD_Pos)                   /*!< 0x00040000 */
#define RCC_RDLSICR_MRD_3                          (0x8UL << RCC_RDLSICR_MRD_Pos)                   /*!< 0x00080000 */
#define RCC_RDLSICR_MRD_4                          (0x10UL << RCC_RDLSICR_MRD_Pos)                  /*!< 0x00100000 */
#define RCC_RDLSICR_EADLY_Pos                      (24U)
#define RCC_RDLSICR_EADLY_Msk                      (0x7UL << RCC_RDLSICR_EADLY_Pos)                     /*!< 0x07000000 */
#define RCC_RDLSICR_EADLY                          RCC_RDLSICR_EADLY_Msk                               /*!< External access delays Written by software. If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure. Time to wait before the BOOTROM performs any external access (UART, USB, QUADSPI, FMC, SDMMC,...) */
#define RCC_RDLSICR_EADLY_0                        (0x1UL << RCC_RDLSICR_EADLY_Pos)               /*!< 0x01000000 */
#define RCC_RDLSICR_EADLY_1                        (0x2UL << RCC_RDLSICR_EADLY_Pos)               /*!< 0x02000000 */
#define RCC_RDLSICR_EADLY_2                        (0x4UL << RCC_RDLSICR_EADLY_Pos)               /*!< 0x04000000 */
#define RCC_RDLSICR_SPARE_Pos                      (27U)
#define RCC_RDLSICR_SPARE_Msk                      (0x1FUL << RCC_RDLSICR_SPARE_Pos)                    /*!< 0xF8000000 */
#define RCC_RDLSICR_SPARE                          RCC_RDLSICR_SPARE_Msk                               /*!< Spare bits Written by software. If RCC_SECCFGR.RSTSEC, a write access to this field must be secure. A read access may be secure or non-secure. Reserved for future use. */
#define RCC_RDLSICR_SPARE_0                        (0x1UL << RCC_RDLSICR_SPARE_Pos)               /*!< 0x08000000 */
#define RCC_RDLSICR_SPARE_1                        (0x2UL << RCC_RDLSICR_SPARE_Pos)              /*!< 0x10000000 */
#define RCC_RDLSICR_SPARE_2                        (0x4UL << RCC_RDLSICR_SPARE_Pos)              /*!< 0x20000000 */
#define RCC_RDLSICR_SPARE_3                        (0x8UL << RCC_RDLSICR_SPARE_Pos)              /*!< 0x40000000 */
#define RCC_RDLSICR_SPARE_4                        (0x10UL << RCC_RDLSICR_SPARE_Pos)              /*!< 0x80000000 */

/*****************  Bit definition for RCC_OCENSETR register  *****************/
#define RCC_OCENSETR_HSION_Pos                     (0U)
#define RCC_OCENSETR_HSION_Msk                     (0x1UL << RCC_OCENSETR_HSION_Pos)                    /*!< 0x00000001 */
#define RCC_OCENSETR_HSION                         RCC_OCENSETR_HSION_Msk                              /*!< Set HSION bit Set by software to enable the HSI clock. This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1). The HSION is also set by hardware to force the HSI to ON when the product leaves Standby mode or one of the Stop modes. */
#define RCC_OCENSETR_HSIKERON_Pos                  (1U)
#define RCC_OCENSETR_HSIKERON_Msk                  (0x1UL << RCC_OCENSETR_HSIKERON_Pos)                 /*!< 0x00000002 */
#define RCC_OCENSETR_HSIKERON                      RCC_OCENSETR_HSIKERON_Msk                           /*!< Set HSIKERON bit Set by software to force the HSI to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for peripherals. This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1). This bit has no effect on the value of HSION. */
#define RCC_OCENSETR_CSION_Pos                     (4U)
#define RCC_OCENSETR_CSION_Msk                     (0x1UL << RCC_OCENSETR_CSION_Pos)                    /*!< 0x00000010 */
#define RCC_OCENSETR_CSION                         RCC_OCENSETR_CSION_Msk                              /*!< Set CSION bit Set by software to enable CSI clock. This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1). */
#define RCC_OCENSETR_CSIKERON_Pos                  (5U)
#define RCC_OCENSETR_CSIKERON_Msk                  (0x1UL << RCC_OCENSETR_CSIKERON_Pos)                 /*!< 0x00000020 */
#define RCC_OCENSETR_CSIKERON                      RCC_OCENSETR_CSIKERON_Msk                           /*!< Set CSIKERON bit Set by software to force the CSI to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for some peripherals. This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1). This bit has no effect on the value of CSION. */
#define RCC_OCENSETR_DIGBYP_Pos                    (7U)
#define RCC_OCENSETR_DIGBYP_Msk                    (0x1UL << RCC_OCENSETR_DIGBYP_Pos)                   /*!< 0x00000080 */
#define RCC_OCENSETR_DIGBYP                        RCC_OCENSETR_DIGBYP_Msk                             /*!< Set DIGBYP bit Set by software when the external HSE clock is connected to OSC_IN as a full-swing digital signal. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENSETR_HSEON_Pos                     (8U)
#define RCC_OCENSETR_HSEON_Msk                     (0x1UL << RCC_OCENSETR_HSEON_Pos)                    /*!< 0x00000100 */
#define RCC_OCENSETR_HSEON                         RCC_OCENSETR_HSEON_Msk                              /*!< Set HSEON bit Set by software to enable the HSE. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENSETR_HSEKERON_Pos                  (9U)
#define RCC_OCENSETR_HSEKERON_Msk                  (0x1UL << RCC_OCENSETR_HSEKERON_Pos)                 /*!< 0x00000200 */
#define RCC_OCENSETR_HSEKERON                      RCC_OCENSETR_HSEKERON_Msk                           /*!< Set HSEKERON bit Set by software to force the HSE to ON, even in (LP-)Stop mode, in order to be quickly available as kernel clock for some peripherals. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). This bit has no effect on the value of HSEON. */
#define RCC_OCENSETR_HSEBYP_Pos                    (10U)
#define RCC_OCENSETR_HSEBYP_Msk                    (0x1UL << RCC_OCENSETR_HSEBYP_Pos)                   /*!< 0x00000400 */
#define RCC_OCENSETR_HSEBYP                        RCC_OCENSETR_HSEBYP_Msk                             /*!< Set HSEBYP bit Set by software in order to enable the bypass mode. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENSETR_HSECSSON_Pos                  (11U)
#define RCC_OCENSETR_HSECSSON_Msk                  (0x1UL << RCC_OCENSETR_HSECSSON_Pos)                 /*!< 0x00000800 */
#define RCC_OCENSETR_HSECSSON                      RCC_OCENSETR_HSECSSON_Msk                           /*!< Set the HSECSSON bit Set the Clock Security System on HSE. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). This bit is âset onlyâ (disabled by a system reset or when the system enters in Standby mode). When HSECSSON is set, the clock detector is enabled by hardware when the HSE is ready. */

