zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/****************  Bit definition for RCC_PLL3CFGR1 register  *****************/
#define RCC_PLL3CFGR1_DIVN_Pos                     (0U)
#define RCC_PLL3CFGR1_DIVN_Msk                     (0x1FFUL << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x000001FF */
#define RCC_PLL3CFGR1_DIVN                         RCC_PLL3CFGR1_DIVN_Msk                              /*!< Multiplication factor for PLL3 VCO Written by software to control the multiplication factor of the VCO. Warning: the software has to set correctly these bits to ensure that the VCO output frequency is between its valid frequency range, which is between 400 and 800 MHz. VCO output frequency = Fref3_ck x (DIVN+1), when value 0 has been loaded into FRACV, with: - Valid division ratios for DIVN: between 25 and 200 - The input frequency Fref3_ck between 4 and 16 MHz ... ... Others: wrong configurations */
#define RCC_PLL3CFGR1_DIVN_0                       (0x1UL << RCC_PLL3CFGR1_DIVN_Pos)                    /*!< 0x00000001 */
#define RCC_PLL3CFGR1_DIVN_1                       (0x2UL << RCC_PLL3CFGR1_DIVN_Pos)                    /*!< 0x00000002 */
#define RCC_PLL3CFGR1_DIVN_2                       (0x4UL << RCC_PLL3CFGR1_DIVN_Pos)                    /*!< 0x00000004 */
#define RCC_PLL3CFGR1_DIVN_3                       (0x8UL << RCC_PLL3CFGR1_DIVN_Pos)                    /*!< 0x00000008 */
#define RCC_PLL3CFGR1_DIVN_4                       (0x10UL << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000010 */
#define RCC_PLL3CFGR1_DIVN_5                       (0x20UL << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000020 */
#define RCC_PLL3CFGR1_DIVN_6                       (0x40UL << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000040 */
#define RCC_PLL3CFGR1_DIVN_7                       (0x80UL << RCC_PLL3CFGR1_DIVN_Pos)                   /*!< 0x00000080 */
#define RCC_PLL3CFGR1_DIVN_8                       (0x100UL << RCC_PLL3CFGR1_DIVN_Pos)                  /*!< 0x00000100 */
#define RCC_PLL3CFGR1_DIVM3_Pos                    (16U)
#define RCC_PLL3CFGR1_DIVM3_Msk                    (0x3FUL << RCC_PLL3CFGR1_DIVM3_Pos)                  /*!< 0x003F0000 */
#define RCC_PLL3CFGR1_DIVM3                        RCC_PLL3CFGR1_DIVM3_Msk                             /*!< Prescaler for PLL3 Set and cleared by software to configure the prescaler of the PLL3. ... */
#define RCC_PLL3CFGR1_DIVM3_0                      (0x1UL << RCC_PLL3CFGR1_DIVM3_Pos)               /*!< 0x00010000 */
#define RCC_PLL3CFGR1_DIVM3_1                      (0x2UL << RCC_PLL3CFGR1_DIVM3_Pos)               /*!< 0x00020000 */
#define RCC_PLL3CFGR1_DIVM3_2                      (0x4UL << RCC_PLL3CFGR1_DIVM3_Pos)               /*!< 0x00040000 */
#define RCC_PLL3CFGR1_DIVM3_3                      (0x8UL << RCC_PLL3CFGR1_DIVM3_Pos)               /*!< 0x00080000 */
#define RCC_PLL3CFGR1_DIVM3_4                      (0x10UL << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00100000 */
#define RCC_PLL3CFGR1_DIVM3_5                      (0x20UL << RCC_PLL3CFGR1_DIVM3_Pos)              /*!< 0x00200000 */
#define RCC_PLL3CFGR1_IFRGE_Pos                    (24U)
#define RCC_PLL3CFGR1_IFRGE_Msk                    (0x3UL << RCC_PLL3CFGR1_IFRGE_Pos)                   /*!< 0x03000000 */
#define RCC_PLL3CFGR1_IFRGE                        RCC_PLL3CFGR1_IFRGE_Msk                             /*!< PLL3 input frequency range Written by software to select the proper reference frequency range used for PLL3. x0: The PLL3 input (ref3_ck) clock range frequency is between 4 and 8 MHz (default after reset) x1: The PLL3 input (ref3_ck) clock range frequency is between 8 and 16 MHz. Note that if ref3_ck is equal to 8Â MHz, it is recommended to set IFRGE = 'x1â */
#define RCC_PLL3CFGR1_IFRGE_0                      (0x1UL << RCC_PLL3CFGR1_IFRGE_Pos)             /*!< 0x01000000 */
#define RCC_PLL3CFGR1_IFRGE_1                      (0x2UL << RCC_PLL3CFGR1_IFRGE_Pos)             /*!< 0x02000000 */

/****************  Bit definition for RCC_PLL3CFGR2 register  *****************/
#define RCC_PLL3CFGR2_DIVP_Pos                     (0U)
#define RCC_PLL3CFGR2_DIVP_Msk                     (0x7FUL << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x0000007F */
#define RCC_PLL3CFGR2_DIVP                         RCC_PLL3CFGR2_DIVP_Msk                              /*!< PLL3 DIVP division factor Written by software to control the frequency of the pll3_p_ck clock. ... */
#define RCC_PLL3CFGR2_DIVP_0                       (0x1UL << RCC_PLL3CFGR2_DIVP_Pos)                    /*!< 0x00000001 */
#define RCC_PLL3CFGR2_DIVP_1                       (0x2UL << RCC_PLL3CFGR2_DIVP_Pos)                    /*!< 0x00000002 */
#define RCC_PLL3CFGR2_DIVP_2                       (0x4UL << RCC_PLL3CFGR2_DIVP_Pos)                    /*!< 0x00000004 */
#define RCC_PLL3CFGR2_DIVP_3                       (0x8UL << RCC_PLL3CFGR2_DIVP_Pos)                    /*!< 0x00000008 */
#define RCC_PLL3CFGR2_DIVP_4                       (0x10UL << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000010 */
#define RCC_PLL3CFGR2_DIVP_5                       (0x20UL << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000020 */
#define RCC_PLL3CFGR2_DIVP_6                       (0x40UL << RCC_PLL3CFGR2_DIVP_Pos)                   /*!< 0x00000040 */
#define RCC_PLL3CFGR2_DIVQ_Pos                     (8U)
#define RCC_PLL3CFGR2_DIVQ_Msk                     (0x7FUL << RCC_PLL3CFGR2_DIVQ_Pos)                   /*!< 0x00007F00 */
#define RCC_PLL3CFGR2_DIVQ                         RCC_PLL3CFGR2_DIVQ_Msk                              /*!< PLL3 DIVQ division factor Written by software to control the frequency of the pll3_q_ck clock. ... */
#define RCC_PLL3CFGR2_DIVQ_0                       (0x1UL << RCC_PLL3CFGR2_DIVQ_Pos)                  /*!< 0x00000100 */
#define RCC_PLL3CFGR2_DIVQ_1                       (0x2UL << RCC_PLL3CFGR2_DIVQ_Pos)                  /*!< 0x00000200 */
#define RCC_PLL3CFGR2_DIVQ_2                       (0x4UL << RCC_PLL3CFGR2_DIVQ_Pos)                  /*!< 0x00000400 */
#define RCC_PLL3CFGR2_DIVQ_3                       (0x8UL << RCC_PLL3CFGR2_DIVQ_Pos)                  /*!< 0x00000800 */
#define RCC_PLL3CFGR2_DIVQ_4                       (0x10UL << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00001000 */
#define RCC_PLL3CFGR2_DIVQ_5                       (0x20UL << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00002000 */
#define RCC_PLL3CFGR2_DIVQ_6                       (0x40UL << RCC_PLL3CFGR2_DIVQ_Pos)                 /*!< 0x00004000 */
#define RCC_PLL3CFGR2_DIVR_Pos                     (16U)
#define RCC_PLL3CFGR2_DIVR_Msk                     (0x7FUL << RCC_PLL3CFGR2_DIVR_Pos)                   /*!< 0x007F0000 */
#define RCC_PLL3CFGR2_DIVR                         RCC_PLL3CFGR2_DIVR_Msk                              /*!< PLL3 DIVR division factor Written by software to control the frequency of the pll3_r_ck clock. ... */
#define RCC_PLL3CFGR2_DIVR_0                       (0x1UL << RCC_PLL3CFGR2_DIVR_Pos)                /*!< 0x00010000 */
#define RCC_PLL3CFGR2_DIVR_1                       (0x2UL << RCC_PLL3CFGR2_DIVR_Pos)                /*!< 0x00020000 */
#define RCC_PLL3CFGR2_DIVR_2                       (0x4UL << RCC_PLL3CFGR2_DIVR_Pos)                /*!< 0x00040000 */
#define RCC_PLL3CFGR2_DIVR_3                       (0x8UL << RCC_PLL3CFGR2_DIVR_Pos)                /*!< 0x00080000 */
#define RCC_PLL3CFGR2_DIVR_4                       (0x10UL << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00100000 */
#define RCC_PLL3CFGR2_DIVR_5                       (0x20UL << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00200000 */
#define RCC_PLL3CFGR2_DIVR_6                       (0x40UL << RCC_PLL3CFGR2_DIVR_Pos)               /*!< 0x00400000 */

/****************  Bit definition for RCC_PLL3FRACR register  *****************/
#define RCC_PLL3FRACR_FRACV_Pos                    (3U)
#define RCC_PLL3FRACR_FRACV_Msk                    (0x1FFFUL << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x0000FFF8 */
#define RCC_PLL3FRACR_FRACV                        RCC_PLL3FRACR_FRACV_Msk                             /*!< Fractional part of the multiplication factor for PLL3 VCO Written by software to control the fractional part of the multiplication factor of the VCO. These bits can be written at any time, allowing dynamic fine-tuning of the PLL3 VCO. Warning: the software has to set correctly these bits to ensure that the VCO output frequency is between its valid frequency range, which is between 400 and 800 MHz. VCO output frequency = Fref3_ck x ((DIVN+1) + (FRACV / 8192)), with - DIVN shall be between 4 and 512 - FRACV can be between 0 and 8191 - The input frequency Fref3_ck shall be between 1 and 16 MHz In order to change the FRACV value on-the-fly even if the PLL is enabled, the application has to proceed as follow: - set the bit FRACLE to '0', - write the new fractional value into FRACV, - set the bit FRACLE to '1'. */
#define RCC_PLL3FRACR_FRACV_0                      (0x1UL << RCC_PLL3FRACR_FRACV_Pos)                   /*!< 0x00000008 */
#define RCC_PLL3FRACR_FRACV_1                      (0x2UL << RCC_PLL3FRACR_FRACV_Pos)                  /*!< 0x00000010 */
#define RCC_PLL3FRACR_FRACV_2                      (0x4UL << RCC_PLL3FRACR_FRACV_Pos)                  /*!< 0x00000020 */
#define RCC_PLL3FRACR_FRACV_3                      (0x8UL << RCC_PLL3FRACR_FRACV_Pos)                  /*!< 0x00000040 */
#define RCC_PLL3FRACR_FRACV_4                      (0x10UL << RCC_PLL3FRACR_FRACV_Pos)                  /*!< 0x00000080 */
#define RCC_PLL3FRACR_FRACV_5                      (0x20UL << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000100 */
#define RCC_PLL3FRACR_FRACV_6                      (0x40UL << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000200 */
#define RCC_PLL3FRACR_FRACV_7                      (0x80UL << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000400 */
#define RCC_PLL3FRACR_FRACV_8                      (0x100UL << RCC_PLL3FRACR_FRACV_Pos)                 /*!< 0x00000800 */
#define RCC_PLL3FRACR_FRACV_9                      (0x200UL << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00001000 */
#define RCC_PLL3FRACR_FRACV_10                     (0x400UL << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00002000 */
#define RCC_PLL3FRACR_FRACV_11                     (0x800UL << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00004000 */
#define RCC_PLL3FRACR_FRACV_12                     (0x1000UL << RCC_PLL3FRACR_FRACV_Pos)                /*!< 0x00008000 */
#define RCC_PLL3FRACR_FRACLE_Pos                   (16U)
#define RCC_PLL3FRACR_FRACLE_Msk                   (0x1UL << RCC_PLL3FRACR_FRACLE_Pos)                  /*!< 0x00010000 */
#define RCC_PLL3FRACR_FRACLE                       RCC_PLL3FRACR_FRACLE_Msk                            /*!< PLL3 fractional latch enable Set and reset by software to latch the content of FRACV into the Sigma-Delta modulator. In order to latch the FRACV value into the Sigma-Delta modulator, FRACLE must be set to '0', then set to '1': the transition 0 to '1' transfers the content of FRACV into the modulator. Refer to and for additional information on the PLL programming. */

/*****************  Bit definition for RCC_PLL3CSGR register  *****************/
#define RCC_PLL3CSGR_MOD_PER_Pos                   (0U)
#define RCC_PLL3CSGR_MOD_PER_Msk                   (0x1FFFUL << RCC_PLL3CSGR_MOD_PER_Pos)               /*!< 0x00001FFF */
#define RCC_PLL3CSGR_MOD_PER                       RCC_PLL3CSGR_MOD_PER_Msk                            /*!< Modulation Period Adjustment for PLL3 Written by software to adjust the modulation period of the clock spreading generator. */
#define RCC_PLL3CSGR_MOD_PER_0                     (0x1UL << RCC_PLL3CSGR_MOD_PER_Pos)                  /*!< 0x00000001 */
#define RCC_PLL3CSGR_MOD_PER_1                     (0x2UL << RCC_PLL3CSGR_MOD_PER_Pos)                  /*!< 0x00000002 */
#define RCC_PLL3CSGR_MOD_PER_2                     (0x4UL << RCC_PLL3CSGR_MOD_PER_Pos)                  /*!< 0x00000004 */
#define RCC_PLL3CSGR_MOD_PER_3                     (0x8UL << RCC_PLL3CSGR_MOD_PER_Pos)                  /*!< 0x00000008 */
#define RCC_PLL3CSGR_MOD_PER_4                     (0x10UL << RCC_PLL3CSGR_MOD_PER_Pos)                 /*!< 0x00000010 */
#define RCC_PLL3CSGR_MOD_PER_5                     (0x20UL << RCC_PLL3CSGR_MOD_PER_Pos)                 /*!< 0x00000020 */
#define RCC_PLL3CSGR_MOD_PER_6                     (0x40UL << RCC_PLL3CSGR_MOD_PER_Pos)                 /*!< 0x00000040 */
#define RCC_PLL3CSGR_MOD_PER_7                     (0x80UL << RCC_PLL3CSGR_MOD_PER_Pos)                 /*!< 0x00000080 */
#define RCC_PLL3CSGR_MOD_PER_8                     (0x100UL << RCC_PLL3CSGR_MOD_PER_Pos)                /*!< 0x00000100 */
#define RCC_PLL3CSGR_MOD_PER_9                     (0x200UL << RCC_PLL3CSGR_MOD_PER_Pos)                /*!< 0x00000200 */
#define RCC_PLL3CSGR_MOD_PER_10                    (0x400UL << RCC_PLL3CSGR_MOD_PER_Pos)                /*!< 0x00000400 */
#define RCC_PLL3CSGR_MOD_PER_11                    (0x800UL << RCC_PLL3CSGR_MOD_PER_Pos)                /*!< 0x00000800 */
#define RCC_PLL3CSGR_MOD_PER_12                    (0x1000UL << RCC_PLL3CSGR_MOD_PER_Pos)               /*!< 0x00001000 */
#define RCC_PLL3CSGR_TPDFN_DIS_Pos                 (13U)
#define RCC_PLL3CSGR_TPDFN_DIS_Msk                 (0x1UL << RCC_PLL3CSGR_TPDFN_DIS_Pos)                /*!< 0x00002000 */
#define RCC_PLL3CSGR_TPDFN_DIS                     RCC_PLL3CSGR_TPDFN_DIS_Msk                          /*!< Dithering TPDF noise control Set and reset by software. This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function. */
#define RCC_PLL3CSGR_RPDFN_DIS_Pos                 (14U)
#define RCC_PLL3CSGR_RPDFN_DIS_Msk                 (0x1UL << RCC_PLL3CSGR_RPDFN_DIS_Pos)                /*!< 0x00004000 */
#define RCC_PLL3CSGR_RPDFN_DIS                     RCC_PLL3CSGR_RPDFN_DIS_Msk                          /*!< Dithering RPDF noise control Set and reset by software. This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function. */
#define RCC_PLL3CSGR_SSCG_MODE_Pos                 (15U)
#define RCC_PLL3CSGR_SSCG_MODE_Msk                 (0x1UL << RCC_PLL3CSGR_SSCG_MODE_Pos)                /*!< 0x00008000 */
#define RCC_PLL3CSGR_SSCG_MODE                     RCC_PLL3CSGR_SSCG_MODE_Msk                          /*!< Spread spectrum clock generator mode Set and reset by software to select the clock spreading mode. */
#define RCC_PLL3CSGR_INC_STEP_Pos                  (16U)
#define RCC_PLL3CSGR_INC_STEP_Msk                  (0x7FFFUL << RCC_PLL3CSGR_INC_STEP_Pos)              /*!< 0x7FFF0000 */
#define RCC_PLL3CSGR_INC_STEP                      RCC_PLL3CSGR_INC_STEP_Msk                           /*!< Modulation Depth Adjustment for PLL3 Written by software to adjust the modulation depth of the clock spreading generator. */
#define RCC_PLL3CSGR_INC_STEP_0                    (0x1UL << RCC_PLL3CSGR_INC_STEP_Pos)             /*!< 0x00010000 */
#define RCC_PLL3CSGR_INC_STEP_1                    (0x2UL << RCC_PLL3CSGR_INC_STEP_Pos)             /*!< 0x00020000 */
#define RCC_PLL3CSGR_INC_STEP_2                    (0x4UL << RCC_PLL3CSGR_INC_STEP_Pos)             /*!< 0x00040000 */
#define RCC_PLL3CSGR_INC_STEP_3                    (0x8UL << RCC_PLL3CSGR_INC_STEP_Pos)             /*!< 0x00080000 */
#define RCC_PLL3CSGR_INC_STEP_4                    (0x10UL << RCC_PLL3CSGR_INC_STEP_Pos)            /*!< 0x00100000 */
#define RCC_PLL3CSGR_INC_STEP_5                    (0x20UL << RCC_PLL3CSGR_INC_STEP_Pos)            /*!< 0x00200000 */
#define RCC_PLL3CSGR_INC_STEP_6                    (0x40UL << RCC_PLL3CSGR_INC_STEP_Pos)            /*!< 0x00400000 */
#define RCC_PLL3CSGR_INC_STEP_7                    (0x80UL << RCC_PLL3CSGR_INC_STEP_Pos)            /*!< 0x00800000 */
#define RCC_PLL3CSGR_INC_STEP_8                    (0x100UL << RCC_PLL3CSGR_INC_STEP_Pos)           /*!< 0x01000000 */
#define RCC_PLL3CSGR_INC_STEP_9                    (0x200UL << RCC_PLL3CSGR_INC_STEP_Pos)           /*!< 0x02000000 */
#define RCC_PLL3CSGR_INC_STEP_10                   (0x400UL << RCC_PLL3CSGR_INC_STEP_Pos)           /*!< 0x04000000 */
#define RCC_PLL3CSGR_INC_STEP_11                   (0x800UL << RCC_PLL3CSGR_INC_STEP_Pos)           /*!< 0x08000000 */
#define RCC_PLL3CSGR_INC_STEP_12                   (0x1000UL << RCC_PLL3CSGR_INC_STEP_Pos)          /*!< 0x10000000 */
#define RCC_PLL3CSGR_INC_STEP_13                   (0x2000UL << RCC_PLL3CSGR_INC_STEP_Pos)          /*!< 0x20000000 */
#define RCC_PLL3CSGR_INC_STEP_14                   (0x4000UL << RCC_PLL3CSGR_INC_STEP_Pos)          /*!< 0x40000000 */

/******************  Bit definition for RCC_PLL4CR register  ******************/
#define RCC_PLL4CR_PLLON_Pos                       (0U)
#define RCC_PLL4CR_PLLON_Msk                       (0x1UL << RCC_PLL4CR_PLLON_Pos)                      /*!< 0x00000001 */
#define RCC_PLL4CR_PLLON                           RCC_PLL4CR_PLLON_Msk                                /*!< PLL4 enable Set and cleared by software to enable the PLL4. Cleared by hardware when entering a Stop mode or Standby. Note that DIVPEN, DIVQEN and DIVREN of PLL4 must be set to '0â before setting PLLON to '0â. refer to for details. */
#define RCC_PLL4CR_PLL4RDY_Pos                     (1U)
#define RCC_PLL4CR_PLL4RDY_Msk                     (0x1UL << RCC_PLL4CR_PLL4RDY_Pos)                    /*!< 0x00000002 */
#define RCC_PLL4CR_PLL4RDY                         RCC_PLL4CR_PLL4RDY_Msk                              /*!< PLL4 clock ready flag Set by hardware to indicate that the PLL4 is locked. */
#define RCC_PLL4CR_SSCG_CTRL_Pos                   (2U)
#define RCC_PLL4CR_SSCG_CTRL_Msk                   (0x1UL << RCC_PLL4CR_SSCG_CTRL_Pos)                  /*!< 0x00000004 */
#define RCC_PLL4CR_SSCG_CTRL                       RCC_PLL4CR_SSCG_CTRL_Msk                            /*!< Clock Spreading Generator of PLL4 enable Set and reset by software to enable the clock spreading generator of PLL4, in order to reduce the amount of EMI peaks. */
#define RCC_PLL4CR_DIVPEN_Pos                      (4U)
#define RCC_PLL4CR_DIVPEN_Msk                      (0x1UL << RCC_PLL4CR_DIVPEN_Pos)                     /*!< 0x00000010 */
#define RCC_PLL4CR_DIVPEN                          RCC_PLL4CR_DIVPEN_Msk                               /*!< PLL4 DIVP divider output enable Set and reset by software to enable the pll4_p_ck output of the PLL4. Cleared by hardware when entering a Stop mode or Standby. In order to save power, when the pll4_p_ck is not needed, DIVPEN must be set to '0'. */
#define RCC_PLL4CR_DIVQEN_Pos                      (5U)
#define RCC_PLL4CR_DIVQEN_Msk                      (0x1UL << RCC_PLL4CR_DIVQEN_Pos)                     /*!< 0x00000020 */
#define RCC_PLL4CR_DIVQEN                          RCC_PLL4CR_DIVQEN_Msk                               /*!< PLL4 DIVQ divider output enable Set and reset by software to enable the pll4_q_ck output of the PLL4. Cleared by hardware when entering a Stop mode or Standby. In order to save power, when the pll4_q_ck is not needed, DIVQEN must be set to '0'. */
#define RCC_PLL4CR_DIVREN_Pos                      (6U)
#define RCC_PLL4CR_DIVREN_Msk                      (0x1UL << RCC_PLL4CR_DIVREN_Pos)                     /*!< 0x00000040 */
#define RCC_PLL4CR_DIVREN                          RCC_PLL4CR_DIVREN_Msk                               /*!< PLL4 DIVR divider output enable Set and reset by software to enable the pll4_r_ck output of the PLL4. Cleared by hardware when entering a Stop mode or Standby. In order to save power, when the pll4_r_ck is not needed, DIVREN must be set to '0'. */

/****************  Bit definition for RCC_PLL4CFGR1 register  *****************/
#define RCC_PLL4CFGR1_DIVN_Pos                     (0U)
#define RCC_PLL4CFGR1_DIVN_Msk                     (0x1FFUL << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x000001FF */
#define RCC_PLL4CFGR1_DIVN                         RCC_PLL4CFGR1_DIVN_Msk                              /*!< Multiplication factor for PLL4 VCO Written by software to control the multiplication factor of the VCO. Warning: the software has to set correctly these bits to ensure that the VCO output frequency is between its valid frequency range, which is between 400 and 800 MHz. VCO output frequency = Fref4_ck x (DIVN+1), when value 0 has been loaded into FRACV, with: - Valid division ratios for DIVN: between 25 and 200 - The input frequency Fref4_ck between 4 and 16 MHz ... ... Others: wrong configurations */
#define RCC_PLL4CFGR1_DIVN_0                       (0x1UL << RCC_PLL4CFGR1_DIVN_Pos)                    /*!< 0x00000001 */
#define RCC_PLL4CFGR1_DIVN_1                       (0x2UL << RCC_PLL4CFGR1_DIVN_Pos)                    /*!< 0x00000002 */
#define RCC_PLL4CFGR1_DIVN_2                       (0x4UL << RCC_PLL4CFGR1_DIVN_Pos)                    /*!< 0x00000004 */
#define RCC_PLL4CFGR1_DIVN_3                       (0x8UL << RCC_PLL4CFGR1_DIVN_Pos)                    /*!< 0x00000008 */
#define RCC_PLL4CFGR1_DIVN_4                       (0x10UL << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000010 */
#define RCC_PLL4CFGR1_DIVN_5                       (0x20UL << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000020 */
#define RCC_PLL4CFGR1_DIVN_6                       (0x40UL << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000040 */
#define RCC_PLL4CFGR1_DIVN_7                       (0x80UL << RCC_PLL4CFGR1_DIVN_Pos)                   /*!< 0x00000080 */
#define RCC_PLL4CFGR1_DIVN_8                       (0x100UL << RCC_PLL4CFGR1_DIVN_Pos)                  /*!< 0x00000100 */
#define RCC_PLL4CFGR1_DIVM4_Pos                    (16U)
#define RCC_PLL4CFGR1_DIVM4_Msk                    (0x3FUL << RCC_PLL4CFGR1_DIVM4_Pos)                  /*!< 0x003F0000 */
#define RCC_PLL4CFGR1_DIVM4                        RCC_PLL4CFGR1_DIVM4_Msk                             /*!< Prescaler for PLL4 Set and cleared by software to configure the prescaler of the PLL4. ... */
#define RCC_PLL4CFGR1_DIVM4_0                      (0x1UL << RCC_PLL4CFGR1_DIVM4_Pos)               /*!< 0x00010000 */
#define RCC_PLL4CFGR1_DIVM4_1                      (0x2UL << RCC_PLL4CFGR1_DIVM4_Pos)               /*!< 0x00020000 */
#define RCC_PLL4CFGR1_DIVM4_2                      (0x4UL << RCC_PLL4CFGR1_DIVM4_Pos)               /*!< 0x00040000 */
#define RCC_PLL4CFGR1_DIVM4_3                      (0x8UL << RCC_PLL4CFGR1_DIVM4_Pos)               /*!< 0x00080000 */
#define RCC_PLL4CFGR1_DIVM4_4                      (0x10UL << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00100000 */
#define RCC_PLL4CFGR1_DIVM4_5                      (0x20UL << RCC_PLL4CFGR1_DIVM4_Pos)              /*!< 0x00200000 */
#define RCC_PLL4CFGR1_IFRGE_Pos                    (24U)
#define RCC_PLL4CFGR1_IFRGE_Msk                    (0x3UL << RCC_PLL4CFGR1_IFRGE_Pos)                   /*!< 0x03000000 */
#define RCC_PLL4CFGR1_IFRGE                        RCC_PLL4CFGR1_IFRGE_Msk                             /*!< PLL4 input frequency range Written by software to select the proper reference frequency range used for PLL4. x0: The PLL4 input (ref4_ck) clock range frequency is between 4 and 8 MHz (default after reset) x1: The PLL4 input (ref4_ck) clock range frequency is between 8 and 16 MHz Note that if ref3_ck is equal to 8Â MHz, it is recommended to set IFRGE = 'x1â */
#define RCC_PLL4CFGR1_IFRGE_0                      (0x1UL << RCC_PLL4CFGR1_IFRGE_Pos)             /*!< 0x01000000 */
#define RCC_PLL4CFGR1_IFRGE_1                      (0x2UL << RCC_PLL4CFGR1_IFRGE_Pos)             /*!< 0x02000000 */

