zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/*****************  Bit definition for RCC_APB1DIVR register  *****************/
#define RCC_APB1DIVR_APB1DIV_Pos                   (0U)
#define RCC_APB1DIVR_APB1DIV_Msk                   (0x7UL << RCC_APB1DIVR_APB1DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB1DIVR_APB1DIV                       RCC_APB1DIVR_APB1DIV_Msk                            /*!< APB1 clock divider Written by software to control the APB1 clock division factor. The APB1 peripheral clock is divided with the new prescaler factor, from 1 to 16 mlhclk cycles after APB1DIV update. The application can check if the new division factor is taken into account by reading back the APB1DIVRDY flag. others: Not allowed */
#define RCC_APB1DIVR_APB1DIV_0                     (0x1UL << RCC_APB1DIVR_APB1DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB1DIVR_APB1DIV_1                     (0x2UL << RCC_APB1DIVR_APB1DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB1DIVR_APB1DIV_2                     (0x4UL << RCC_APB1DIVR_APB1DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB1DIVR_APB1DIVRDY_Pos                (31U)
#define RCC_APB1DIVR_APB1DIVRDY_Msk                (0x1UL << RCC_APB1DIVR_APB1DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB1DIVR_APB1DIVRDY                    RCC_APB1DIVR_APB1DIVRDY_Msk                         /*!< APB1 clock prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_APB2DIVR register  *****************/
#define RCC_APB2DIVR_APB2DIV_Pos                   (0U)
#define RCC_APB2DIVR_APB2DIV_Msk                   (0x7UL << RCC_APB2DIVR_APB2DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB2DIVR_APB2DIV                       RCC_APB2DIVR_APB2DIV_Msk                            /*!< APB2 clock divider Written by software to control the APB2 clock division factor. The APB2 clock is divided with the new prescaler factor, from 1 to 16 mlhclk cycles after APB2DIV update. The application can check if the new division factor is taken into account by reading back the APB2DIVRDY flag. others: Not allowed */
#define RCC_APB2DIVR_APB2DIV_0                     (0x1UL << RCC_APB2DIVR_APB2DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB2DIVR_APB2DIV_1                     (0x2UL << RCC_APB2DIVR_APB2DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB2DIVR_APB2DIV_2                     (0x4UL << RCC_APB2DIVR_APB2DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB2DIVR_APB2DIVRDY_Pos                (31U)
#define RCC_APB2DIVR_APB2DIVRDY_Msk                (0x1UL << RCC_APB2DIVR_APB2DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB2DIVR_APB2DIVRDY                    RCC_APB2DIVR_APB2DIVRDY_Msk                         /*!< APB2 clock prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_APB3DIVR register  *****************/
#define RCC_APB3DIVR_APB3DIV_Pos                   (0U)
#define RCC_APB3DIVR_APB3DIV_Msk                   (0x7UL << RCC_APB3DIVR_APB3DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB3DIVR_APB3DIV                       RCC_APB3DIVR_APB3DIV_Msk                            /*!< APB3 clock divider Written by software to control the APB3 clock division factor. The APB3 clock is divided by this new prescaler factor, from 1 to 16 hclk cycles after APB3DIV update. The application can check if the new division factor is taken into account by reading back the APB3DIVRDY flag. others: hclk / 16 */
#define RCC_APB3DIVR_APB3DIV_0                     (0x1UL << RCC_APB3DIVR_APB3DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB3DIVR_APB3DIV_1                     (0x2UL << RCC_APB3DIVR_APB3DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB3DIVR_APB3DIV_2                     (0x4UL << RCC_APB3DIVR_APB3DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB3DIVR_APB3DIVRDY_Pos                (31U)
#define RCC_APB3DIVR_APB3DIVRDY_Msk                (0x1UL << RCC_APB3DIVR_APB3DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB3DIVR_APB3DIVRDY                    RCC_APB3DIVR_APB3DIVRDY_Msk                         /*!< APB3 clock prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_APB4DIVR register  *****************/
#define RCC_APB4DIVR_APB4DIV_Pos                   (0U)
#define RCC_APB4DIVR_APB4DIV_Msk                   (0x7UL << RCC_APB4DIVR_APB4DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB4DIVR_APB4DIV                       RCC_APB4DIVR_APB4DIV_Msk                            /*!< APB4 clock divider Written by software to control the APB4 clock division factor. It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB4 clock. The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB4DIV update. The application can check if the new division factor is taken into account by reading back the APB4DIVRDY flag. others: aclk / 16 */
#define RCC_APB4DIVR_APB4DIV_0                     (0x1UL << RCC_APB4DIVR_APB4DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB4DIVR_APB4DIV_1                     (0x2UL << RCC_APB4DIVR_APB4DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB4DIVR_APB4DIV_2                     (0x4UL << RCC_APB4DIVR_APB4DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB4DIVR_APB4DIVRDY_Pos                (31U)
#define RCC_APB4DIVR_APB4DIVRDY_Msk                (0x1UL << RCC_APB4DIVR_APB4DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB4DIVR_APB4DIVRDY                    RCC_APB4DIVR_APB4DIVRDY_Msk                         /*!< APB4 clock divider status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_APB5DIVR register  *****************/
#define RCC_APB5DIVR_APB5DIV_Pos                   (0U)
#define RCC_APB5DIVR_APB5DIV_Msk                   (0x7UL << RCC_APB5DIVR_APB5DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB5DIVR_APB5DIV                       RCC_APB5DIVR_APB5DIV_Msk                            /*!< APB5 clock divider Written by software to control the APB5 clock division factor. It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB5 clock. The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB5DIV update. The application can check if the new division factor is taken into account by reading the APB5DIVRDY flag. others: aclk / 16 */
#define RCC_APB5DIVR_APB5DIV_0                     (0x1UL << RCC_APB5DIVR_APB5DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB5DIVR_APB5DIV_1                     (0x2UL << RCC_APB5DIVR_APB5DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB5DIVR_APB5DIV_2                     (0x4UL << RCC_APB5DIVR_APB5DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB5DIVR_APB5DIVRDY_Pos                (31U)
#define RCC_APB5DIVR_APB5DIVRDY_Msk                (0x1UL << RCC_APB5DIVR_APB5DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB5DIVR_APB5DIVRDY                    RCC_APB5DIVR_APB5DIVRDY_Msk                         /*!< APB5 clock divider status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_APB6DIVR register  *****************/
#define RCC_APB6DIVR_APB6DIV_Pos                   (0U)
#define RCC_APB6DIVR_APB6DIV_Msk                   (0x7UL << RCC_APB6DIVR_APB6DIV_Pos)                  /*!< 0x00000007 */
#define RCC_APB6DIVR_APB6DIV                       RCC_APB6DIVR_APB6DIV_Msk                            /*!< APB6 clock divider Written by software to control the APB6 clock division factor. It is possible to change this division ratio on-the-fly. It impacts only the frequency of APB6 clock. The clocks are divided with the new prescaler factor, from 1 to 16 aclk cycles after APB6DIV update. The application can check if the new division factor is taken into account by reading the APB6DIVRDY flag. others: aclk / 16 */
#define RCC_APB6DIVR_APB6DIV_0                     (0x1UL << RCC_APB6DIVR_APB6DIV_Pos)                  /*!< 0x00000001 */
#define RCC_APB6DIVR_APB6DIV_1                     (0x2UL << RCC_APB6DIVR_APB6DIV_Pos)                  /*!< 0x00000002 */
#define RCC_APB6DIVR_APB6DIV_2                     (0x4UL << RCC_APB6DIVR_APB6DIV_Pos)                  /*!< 0x00000004 */
#define RCC_APB6DIVR_APB6DIVRDY_Pos                (31U)
#define RCC_APB6DIVR_APB6DIVRDY_Msk                (0x1UL << RCC_APB6DIVR_APB6DIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_APB6DIVR_APB6DIVRDY                    RCC_APB6DIVR_APB6DIVRDY_Msk                         /*!< APB6 clock divider status Set and reset by hardware to indicate if the new division factor is taken into account. */

/****************  Bit definition for RCC_TIMG1PRER register  *****************/
#define RCC_TIMG1PRER_TIMG1PRE_Pos                 (0U)
#define RCC_TIMG1PRER_TIMG1PRE_Msk                 (0x1UL << RCC_TIMG1PRER_TIMG1PRE_Pos)                /*!< 0x00000001 */
#define RCC_TIMG1PRER_TIMG1PRE                     RCC_TIMG1PRER_TIMG1PRE_Msk                          /*!< Timers clocks prescaler selection This bit is set and reset by software to control the clock frequency of all the timers connected to APB1 domain. Refer to . */
#define RCC_TIMG1PRER_TIMG1PRERDY_Pos              (31U)
#define RCC_TIMG1PRER_TIMG1PRERDY_Msk              (0x1UL << RCC_TIMG1PRER_TIMG1PRERDY_Pos)             /*!< 0x80000000 */
#define RCC_TIMG1PRER_TIMG1PRERDY                  RCC_TIMG1PRER_TIMG1PRERDY_Msk                       /*!< Timers clocks prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

