zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135dxx_ca7.h
/***************  Bit definition for RCC_AHB4RSTSETR register  ****************/
#define RCC_AHB4RSTSETR_GPIOARST_Pos               (0U)
#define RCC_AHB4RSTSETR_GPIOARST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOARST_Pos)              /*!< 0x00000001 */
#define RCC_AHB4RSTSETR_GPIOARST                   RCC_AHB4RSTSETR_GPIOARST_Msk                        /*!< GPIOA block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOBRST_Pos               (1U)
#define RCC_AHB4RSTSETR_GPIOBRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOBRST_Pos)              /*!< 0x00000002 */
#define RCC_AHB4RSTSETR_GPIOBRST                   RCC_AHB4RSTSETR_GPIOBRST_Msk                        /*!< GPIOB block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOCRST_Pos               (2U)
#define RCC_AHB4RSTSETR_GPIOCRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOCRST_Pos)              /*!< 0x00000004 */
#define RCC_AHB4RSTSETR_GPIOCRST                   RCC_AHB4RSTSETR_GPIOCRST_Msk                        /*!< GPIOC block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIODRST_Pos               (3U)
#define RCC_AHB4RSTSETR_GPIODRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIODRST_Pos)              /*!< 0x00000008 */
#define RCC_AHB4RSTSETR_GPIODRST                   RCC_AHB4RSTSETR_GPIODRST_Msk                        /*!< GPIOD block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOERST_Pos               (4U)
#define RCC_AHB4RSTSETR_GPIOERST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOERST_Pos)              /*!< 0x00000010 */
#define RCC_AHB4RSTSETR_GPIOERST                   RCC_AHB4RSTSETR_GPIOERST_Msk                        /*!< GPIOE block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOFRST_Pos               (5U)
#define RCC_AHB4RSTSETR_GPIOFRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOFRST_Pos)              /*!< 0x00000020 */
#define RCC_AHB4RSTSETR_GPIOFRST                   RCC_AHB4RSTSETR_GPIOFRST_Msk                        /*!< GPIOF block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOGRST_Pos               (6U)
#define RCC_AHB4RSTSETR_GPIOGRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOGRST_Pos)              /*!< 0x00000040 */
#define RCC_AHB4RSTSETR_GPIOGRST                   RCC_AHB4RSTSETR_GPIOGRST_Msk                        /*!< GPIOG block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOHRST_Pos               (7U)
#define RCC_AHB4RSTSETR_GPIOHRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOHRST_Pos)              /*!< 0x00000080 */
#define RCC_AHB4RSTSETR_GPIOHRST                   RCC_AHB4RSTSETR_GPIOHRST_Msk                        /*!< GPIOH block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_AHB4RSTSETR_GPIOIRST_Pos               (8U)
#define RCC_AHB4RSTSETR_GPIOIRST_Msk               (0x1UL << RCC_AHB4RSTSETR_GPIOIRST_Pos)              /*!< 0x00000100 */
#define RCC_AHB4RSTSETR_GPIOIRST                   RCC_AHB4RSTSETR_GPIOIRST_Msk                        /*!< GPIOI block reset A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */

/***************  Bit definition for RCC_AHB4RSTCLRR register  ****************/
#define RCC_AHB4RSTCLRR_GPIOARST_Pos               (0U)
#define RCC_AHB4RSTCLRR_GPIOARST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOARST_Pos)              /*!< 0x00000001 */
#define RCC_AHB4RSTCLRR_GPIOARST                   RCC_AHB4RSTCLRR_GPIOARST_Msk                        /*!< GPIOA block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOBRST_Pos               (1U)
#define RCC_AHB4RSTCLRR_GPIOBRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOBRST_Pos)              /*!< 0x00000002 */
#define RCC_AHB4RSTCLRR_GPIOBRST                   RCC_AHB4RSTCLRR_GPIOBRST_Msk                        /*!< GPIOB block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOCRST_Pos               (2U)
#define RCC_AHB4RSTCLRR_GPIOCRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOCRST_Pos)              /*!< 0x00000004 */
#define RCC_AHB4RSTCLRR_GPIOCRST                   RCC_AHB4RSTCLRR_GPIOCRST_Msk                        /*!< GPIOC block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIODRST_Pos               (3U)
#define RCC_AHB4RSTCLRR_GPIODRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIODRST_Pos)              /*!< 0x00000008 */
#define RCC_AHB4RSTCLRR_GPIODRST                   RCC_AHB4RSTCLRR_GPIODRST_Msk                        /*!< GPIOD block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOERST_Pos               (4U)
#define RCC_AHB4RSTCLRR_GPIOERST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOERST_Pos)              /*!< 0x00000010 */
#define RCC_AHB4RSTCLRR_GPIOERST                   RCC_AHB4RSTCLRR_GPIOERST_Msk                        /*!< GPIOE block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOFRST_Pos               (5U)
#define RCC_AHB4RSTCLRR_GPIOFRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOFRST_Pos)              /*!< 0x00000020 */
#define RCC_AHB4RSTCLRR_GPIOFRST                   RCC_AHB4RSTCLRR_GPIOFRST_Msk                        /*!< GPIOF block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOGRST_Pos               (6U)
#define RCC_AHB4RSTCLRR_GPIOGRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOGRST_Pos)              /*!< 0x00000040 */
#define RCC_AHB4RSTCLRR_GPIOGRST                   RCC_AHB4RSTCLRR_GPIOGRST_Msk                        /*!< GPIOG block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOHRST_Pos               (7U)
#define RCC_AHB4RSTCLRR_GPIOHRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOHRST_Pos)              /*!< 0x00000080 */
#define RCC_AHB4RSTCLRR_GPIOHRST                   RCC_AHB4RSTCLRR_GPIOHRST_Msk                        /*!< GPIOH block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_AHB4RSTCLRR_GPIOIRST_Pos               (8U)
#define RCC_AHB4RSTCLRR_GPIOIRST_Msk               (0x1UL << RCC_AHB4RSTCLRR_GPIOIRST_Pos)              /*!< 0x00000100 */
#define RCC_AHB4RSTCLRR_GPIOIRST                   RCC_AHB4RSTCLRR_GPIOIRST_Msk                        /*!< GPIOI block reset A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */

